-- phpMyAdmin SQL Dump
-- version 4.8.1
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Sep 05, 2018 at 10:41 AM
-- Server version: 10.1.26-MariaDB-0+deb9u1
-- PHP Version: 7.2.7-1+0~20180622080745.23+stretch~1.gbpfd8e2e

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `construction`
--

-- --------------------------------------------------------

--
-- Table structure for table `advertisements`
--

CREATE TABLE `advertisements` (
  `id` int(11) NOT NULL,
  `url` varchar(120) DEFAULT NULL,
  `photo` varchar(120) DEFAULT NULL,
  `order` int(11) DEFAULT '0',
  `active` tinyint(4) NOT NULL DEFAULT '1',
  `create_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `advertisements`
--

INSERT INTO `advertisements` (`id`, `url`, `photo`, `order`, `active`, `create_at`) VALUES
(1, '#', 'ad1.png', 0, 1, '2018-05-09 08:00:06'),
(2, 'https://www.facebook.com/', 'ad2.jpg', 0, 1, '2018-05-21 06:54:39');

-- --------------------------------------------------------

--
-- Table structure for table `background_images`
--

CREATE TABLE `background_images` (
  `id` int(11) NOT NULL,
  `photo` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `background_images`
--

INSERT INTO `background_images` (`id`, `photo`) VALUES
(1, 'background1.jpg');

-- --------------------------------------------------------

--
-- Table structure for table `categories`
--

CREATE TABLE `categories` (
  `id` int(11) NOT NULL,
  `name` varchar(90) NOT NULL,
  `parent_id` int(11) DEFAULT '0',
  `active` bit(1) NOT NULL DEFAULT b'1',
  `create_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `icon` varchar(220) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `categories`
--

INSERT INTO `categories` (`id`, `name`, `parent_id`, `active`, `create_at`, `icon`) VALUES
(1, 'News', 0, b'1', '2018-02-16 14:54:52', NULL),
(10, 'National News', 1, b'1', '2018-05-27 13:42:02', NULL),
(11, 'Economics', 1, b'1', '2018-05-27 13:42:23', NULL),
(12, 'Sports', 1, b'1', '2018-05-27 13:42:30', NULL),
(13, 'Projects', 0, b'1', '2018-05-27 13:59:16', NULL),
(14, 'Test', 1, b'0', '2018-05-27 16:21:17', NULL),
(15, 'Test', 0, b'1', '2018-06-05 05:43:22', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `company_features`
--

CREATE TABLE `company_features` (
  `id` int(11) NOT NULL,
  `title` varchar(30) NOT NULL,
  `short_description` varchar(225) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `company_features`
--

INSERT INTO `company_features` (`id`, `title`, `short_description`) VALUES
(1, 'CONSULTING', 'Lorem ipsum dolor sit amet, adipisicing elit. Amet numquam aspernatur eum quasi sapiente nesciunt? Voluptatibus sit'),
(2, 'ACHIEVEMENT', 'Lorem ipsum dolor sit amet, consectetur adipiscing elit. Nam viverra euismod odio, gravida pellentesque urna varius vitae.'),
(3, 'HOTEL SUSTAINABILITY', 'Lorem ipsum dolor sit amet, elit. Quos quisquam, error quod sed cumque, odio distinctio velit nostrum temporibus'),
(4, 'TRUST & HONEST', 'Lorem ipsum dolor sit amet, consectetur adipiscing elit. Nam viverra euismod odio, gravida pellentesque urna varius vitae.');

-- --------------------------------------------------------

--
-- Table structure for table `current_projects`
--

CREATE TABLE `current_projects` (
  `id` int(11) NOT NULL,
  `name` text NOT NULL,
  `photo` varchar(80) NOT NULL DEFAULT 'default.png',
  `create_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `active` tinyint(4) DEFAULT '1',
  `order` tinyint(4) DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `current_projects`
--

INSERT INTO `current_projects` (`id`, `name`, `photo`, `create_at`, `active`, `order`) VALUES
(1, '1', 'current_project1.jpg', '2018-05-19 14:28:35', 0, 0),
(2, 'tst', 'current_project2.jpg', '2018-05-19 14:29:38', 1, 0),
(3, 'test', 'current_project3.jpg', '2018-05-19 14:31:59', 1, 1),
(4, 'tst', 'current_project4.jpg', '2018-05-21 07:29:47', 1, 0);

-- --------------------------------------------------------

--
-- Table structure for table `featured_works`
--

CREATE TABLE `featured_works` (
  `id` int(11) NOT NULL,
  `title` varchar(220) NOT NULL,
  `short_description` text,
  `description` longtext,
  `featured_image` varchar(200) DEFAULT NULL,
  `active` tinyint(4) NOT NULL DEFAULT '1',
  `create_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `featured_works`
--

INSERT INTO `featured_works` (`id`, `title`, `short_description`, `description`, `featured_image`, `active`, `create_at`) VALUES
(1, 'Sample News Title From Developer Team', 'Some description of your news can be written here...', '<p>Some articile should be here...</p>', 'post1.jpg', 0, '2018-05-09 08:47:50'),
(2, 'ទម្រង់ប្រមូលករណីសិក្សាលើ សម្មភាពមិត្តអប់រំមិត្ត ស្តីពីសុខភាពបន្តពូជt1', 'ឈ្មោះអ្នកផ្តល់សម្ភាសន៍ សល់ ធូ ភេទ ស្រី អាយុ១៥ មុខរបរ មិត្តអប់រំមិត្ត (សិស្ស) ថ្នាក់ទី៦ សាលាបឋមសិក្សាអ៊ីន អាស័យដ្ឋាននៅ ភូមិ អ៊ីន ឃុំ តាឡាវ ស្រុក អណ្តូងមាស ខេត្ត រតនគិរី ។', '<p><strong>កាលបរិច្ឆេទ ២៩ ខែមីនា ឆ្នាំ ២០១៧</strong></p>\r\n\r\n<p>ឈ្មោះអ្នកផ្តល់សម្ភាសន៍&nbsp;<strong>សល់ ធូ</strong>&nbsp;ភេទ&nbsp;<strong>ស្រី</strong>&nbsp;អាយុ<strong>១៥</strong>&nbsp;មុខរបរ&nbsp;<strong>មិត្តអប់រំមិត្ត</strong>&nbsp;(<strong>សិស្ស</strong><strong>)</strong>&nbsp;ថ្នាក់ទី<strong>៦</strong>&nbsp;សាលាបឋមសិក្សា<strong>អ៊ីន</strong>&nbsp;អាស័យដ្ឋាននៅ ភូមិ&nbsp;<strong>អ៊ីន</strong>&nbsp;ឃុំ&nbsp;<strong>តាឡាវ</strong>&nbsp;ស្រុក&nbsp;<strong>អណ្តូងមាស</strong>&nbsp;ខេត្ត<strong>រតនគិរី</strong>&nbsp;។&nbsp;ប្អូនស្រី&nbsp;<strong>សល់ ធូ</strong>&nbsp;បានមានប្រសាសន៍ដោយលើកឡើងថា កាលពីមុនពេលដែលនាងមិនទាន់បានចូលរួមជាអ្នកស្ម័គ្រចិត្តមិត្តអប់រំមិត្ត របស់សមាគ យុវជនខ្មែរ&nbsp;(KYA)&nbsp;មិនដែលបានបណ្តុះបណ្តាលពីបញ្ហាសុខភាពបន្តពូជ និងសុខភាពផ្លូវភេទមក នាងខ្ញុំក៏ដូចជាមិត្តយុវវ័យដទៃទៀតផងដែរតែងមានការខ្មាសអៀន ហើយក៏មិនបានដឹងថាខ្លួនឯងមានលក្ខណៈនៃរាងកាយ ឫការប្រែប្រួលយ៉ាងដូចម្តេចដែរ ណាមួយពុំដែលបានចាប់អារម្មណ៍ចំពោះបញ្ហាសុខភាពផ្លូវភេទនេះទេពីមុនមក ហើយធ្លាប&nbsp;យល់ថាវាគ្មានសារសំខាន់អ្វីទេ បើចង់ដឹងគ្រាន់តែសួរម៉ែ យាយ ឫស្រី្តចាស់ៗដោយសំងាត់ទៅដឹងហើយ ម្យ៉ាងវិញទៀតគឺគេប្រកាន់ណាស់ថាក្មេងស្រីណានិយាយរឿងសុខភាពផ្លូវភេទអ៊ីចឹងសុទ្ធតែរឿងចំអេះចំអាស និងគេគិតថាជាមនុស្សស្រីមិនល្អផងដែរ&nbsp;(ធ្លាប់ឆ្លងកាត់ការរួមភេទ ជាដើម)&nbsp;។&nbsp;ក្រោយពីបានចូលរួមក្នុងការបណ្តុះបណ្តាលជាមួយសមាគមយុវជនខ្មែរ និងត្រូវបានជ្រើសរើសឲ្យនាងខ្ញុំធ្វើជាមិត្តអប់រំមិត្តរយៈពេលប្រហែល២ឆ្នាំងជាង ក្នុងភូមិអ៊ីន ឃុំអណ្តូងមាស មក នាងខ្ញុំបានខិតខំមើលមេរៀន និងឯកសារបន្ថែមស្តីពីសុខភាពបន្តពូជ ផ្លូវភេទ និងយុវវ័យ ជាពិសេសមេរៀននៃសុខភាពទាំង១២ដែលយើងមានក្នុងដៃសម្រាប់បង្រៀនដល់យុវវ័យបន្ត មុនដំបូងគឺមា ភាពលំបាកខ្លះៗដោយមានការរើសអើង និងមានភាពអៀនខ្មាសច្រើន តែក្រោយពេលដែលបានអប់រំផ្នែកសុខភាពក្នុងភូមិអ៊ីន មួយរយៈកាលនេះមក នាងខ្ញុំសង្កេតឃើញថា យុវវជនមានការកែប្រែ លែងសូវមានភាពខ្មាសអៀន ចេះសាកសួរពីបញ្ហាសុខភាពផ្សេងៗ និងរត់ទៅរកមណ្ឌលសុខភាពដើម្បីសេវាថែទាំផ្សេងៗ និងសម្រាលកូននៅមណ្ឌលជាដើម។&nbsp;នាងខ្ញុំនៅតែចង់បន្តការអប់រំយុវវ័យក្នុងភូមិរបស់នាងខ្ញុំដដែល ដើម្បីចង់ឃើញមានការផ្តាស់ប្តូរទម្លាប់ចាស់ៗ និងទទួលបានចំណេះដឹងថ្មី និងដើម្បីមានភាពរីកចម្រើនផងដែរ ជាពិសេសការយល់ដឹងផ្នែកសុខភាពតែម្តង។ ហើយនាងខ្ញុំចង់សួរថា តើសមាគមយុវជនខ្មែរ បន្តគម្រោងសុខភាពនេះប៉ុន្មានឆ្នាំទៀត?&nbsp;ដោយនាងខ្ញុំចង់ឲ្យសមាគមយុវវជនខ្មែរ នៅតែបន្តការជួយគាំទ្រដល់ការអប់រំផ្នែកសុខភាពនេះ និងជួយបង្រៀនដល់ក្រុមមិត្តអប់រំមិត្ត និងយុវវ័យឲ្យកាន់តែមានភាពក្លានហាន និងចំណេះដឹងថ្មីៗ ។</p>', 'post2.png', 0, '2018-05-09 09:10:57'),
(3, 'ចេះបង្កើតផែនការដើម្បីអនាគត', 'ប្អូនប្រុស សាន​​ វណ្ណារ៉ា ជាសិស្សថ្នាក់ទី៩A នៃវិទ្យាល័យឈីនលាន ហាន់ជ័យ ស្ថិតក្នុងឃុំហាន់ជ័យស្រុកកំពង់សៀម ខេត្តកំពង់ចាម់ មានចម្ងាយ៣០គីឡូម៉ែត ពីទីរួមខេត្តកំពង់ចាម់។ ជាមួយនឹងស្នាមញញឹមប្រកបដោយភាពជឿជាក់ប្អូនប្រុសវណ្ណារ៉ា គឺជាសិស្សម្នាក់', '<p>ប្អូនប្រុស សាន​​ វណ្ណារ៉ា ជាសិស្សថ្នាក់ទី៩A&nbsp;នៃវិទ្យាល័យឈីនលាន ហាន់ជ័យ ស្ថិតក្នុងឃុំហាន់ជ័យស្រុកកំពង់សៀម ខេត្តកំពង់ចាម់ មានចម្ងាយ៣០គីឡូម៉ែត ពីទីរួមខេត្តកំពង់ចាម់។ជាមួយនឹងស្នាមញញឹមប្រកបដោយភាពជឿជាក់ប្អូនប្រុសវណ្ណារ៉ា គឺជាសិស្សម្នាក់ដែលតស៊ូ ក៍ប៉ុន្តែគាត់ទទួលបានត្រឹមចំណាត់ថ្នាក់លេខ ១៥ទៅ១៨ប៉ុណ្ណោះ។ ដោយសមាគមយុវជនខ្មែរតាំងខែមេសា ឆ្នាំ២០១៧មកវណ្ណារ៉ា បានក្លាយជាប្រធានក្លឹបសិក្សា(ក្លឹបក្តីស្រមៃ)ហើយគាត់ខិតខំចូលរួមគ្រប់សកម្មភាព របស់គម្រោង រហូតមានការផ្លាស់ប្តូរឥរិយាបទ នឹងទម្លាប់ជាច្រើនដើម្បីអភិវឌ្ឍន៍ខ្លួនឯង និងសាលារៀនផងដែរ។បន្ទាប់ពីរការប្រជុំនិងការចែករំលែកចំណេះដឹង ដែលផ្តួចផ្តើមពីសមាគមយុវជនខ្មែរសព្វថ្ងៃវណ្ណារ៉ាទទួលបានចំណាត់ថ្នាក់លេខ៨ទៅ៩ជាប្រចាំដែលកាលពីមុនវណ្ណារ៉ាទទួលបានចំណាត់ថ្នាក់លេខ១៥ទៅ៨ប៉ុណ្ណោះ។ វណ្ណារ៉ាមានភាពក្លាហ៊ានជាងមុន ហ៊ានឡើងនិយាយក្នុងចំណោមមនុស្សជាច្រើន បែងចែកប្លង់សំអាតទីធ្លាសាលាជាប្រចាំ មានផែនការអនាគតច្បាស់លាស់។ដោយមើលឃើញភាពក្លាហាន និងភាពជាគម្រូរបស់ វណ្ណារ៉ាមិត្តិភក្ដិរួមថ្នាក់បានអញ្ជើញ ឲ្យជួយពន្យល់មេរៀននៅពេលទំនេរពីការសិក្សារនិងចង់ចូលរួមជាមួយកម្មភាពផ្សេងៗរបស់គាត់។&nbsp;អាណាព្យាបាល វណ្ណារ៉ា រីករាយណាស់ ដែលទទួលបានអាហារូបករណ៍គាត់ជម្រុញឲ្យវណ្ណារ៉ាមករៀនទៀងទាត់ជាងមុន។ វណ្ណារ៉ា ជាក្មេងដែលកំព្រាម្តាយតែទោះជាយ៉ាងណាក៍ដោយវណ្ណារ៉ានៅតែខិតខំប្រឹងប្រែងរៀនសូត្រហើយវណ្ណារ៉ាបានសម្រាចចិត្តថាគាត់និងចាប់អាជីពជាគ្រូបង្រៀ​នគាត់<u>បានប្រាប់វពីមូលហេតុ</u>ផ្សេងៗទៅអាណាព្យាបាលរបស់គាត់ហើយគាត់បានយល់ស្របតាមវណ្ណារ៉ា ថែមទាំងឲ្យវណ្ណារ៉ារៀ​នសូត្រមិនអោយ ធ្វើការងាអ្វីក្រៅពីរៀនឡើយ។&nbsp;លោកគ្រូភា គិននាយកវិទ្យាល័យ ឈីនលានហានជ័យ មានប្រសាសន៍ថា បន្ទាប់ពីសាលាទទួលបានអាហារូបករណ៍ របស់គម្រោងមកសិស្សមានភាពក្លាភាពជាអ្នកដឹកនាំ ជាពិសេសគម្រោងបានមកនូវសកម្មភាពប្លែកៗសម្រាប់សាលា ជាពិសេសSTEM BUS&nbsp;វេទទិការស្ដីពីការងារ យុទ្ធនាការក្នុងសាលា&nbsp;អាហារូបករណ៍លើកកម្ពស់ភាពជាអ្នកដឹកនាំ។ល៕</p>', 'post3.jpg', 0, '2018-05-09 09:11:59'),
(4, 'ការតស៊ូរបស់ក្មេងស្រីម្នាក់ទទួលបានជោគជ័យ តស៊ូខ្ពស់ ដើម្បី ការសិក្សារបស់នាងទទួលបាន ជោគជ័យដោយការ ខិតខំប្រឹងប្រែងទាំងការរៀន', 'ជាមួយភាពជឿជាក់នឹងស្នាមញញឹមដ៏អង់អាចក្លាហាន ដែរធ្វើឲ្យ កញ្ញា ណាង អេង បន្តការសិក្សាជាមួយគោលជំហរដ៏រឹងមាំរបស់ក្មេងស្រីជនបទម្នាក់ដែរមានជីវភាពក្រីក្រ តស៊ូរៀនដោយគ្មានឪពុកម្តាយជាកូនកំព្រារស់នៅជាមួយជីដូចាស់ម្នាក់ដែរមានជំងឺប្រចាំកាយ', '<p>ជាមួយភាពជឿជាក់នឹងស្នាមញញឹមដ៏អង់អាចក្លាហាន ដែរធ្វើឲ្យ កញ្ញា ណាង អេង បន្តការសិក្សាជាមួយគោលជំហរដ៏រឹងមាំរបស់ក្មេងស្រីជនបទម្នាក់ដែរមានជីវភាពក្រីក្រ តស៊ូរៀនដោយគ្មានឪពុកម្តាយជាកូនកំព្រារស់នៅជាមួយជីដូចាស់ម្នាក់ដែរមានជំងឺប្រចាំកាយ ការតស៊ូរៀន របស់ក្មេងស្រីម្នាក់នេះមានការលំបាកខ្លាំង ពីរមុននាងតែងតែទៅរៀនដោយដើរស្មើរជើងពីរផ្ទះទៅសាលាមានចំងាយ៣គីឡូម៉ែត។មានពេលខ្លះនាងបានជិះកងជាមួយមិត្តភត្រ័ពេលខ្លះក៏ដើរទៅសាលាដោយមានការលំបាកខ្លាំងពេកនាងមានបំណងឈប់រៀន។ប៉ុន្តែលោកគ្រូនាយករងសាលាវិទ្យាល័យជាចបាននែនាំអោយនាងចូលជាសិស្សអាហារូបករណ៏ក្នុងគម្រោងលើកកម្ពស់អនាគតសិស្សស្រីតាមរយៈការអប់រំ&ldquo;IAGED&rdquo;​&nbsp;នៅក្នុងសមាគមយុវជនខ្មែរសាខាខេត្តព្រៃវែង។&nbsp;ក្រោយពីនាងបានចូលជាសិស្សអាហារូបករណ៍ នាងបានបន្តការសិក្សារហូត ដល់ថ្នាក់ទី ១២&nbsp;កញ្ញាគឺជាសិស្សម្នាក់ដែរទទួលបានការកោតសរសើរពីមិត្តភក្រ័និងលោកគ្រូអ្នកគ្រូរបស់នាងដែរក្លាយជាសិស្សរៀនពូកែ ទាំងផ្នែកភាសាបរទេស និង ភាសាខ្មែរ នាងទទួលបានចំណាត់​ថ្នាក់ លេខតិចជាងមុន រហូត ជារាងរាល់ខែ។</p>\r\n\r\n<p>កញ្ញាបាននិយាយថា&divide;កាលពីមុខមិនទាន់ ចូលជាសិស្សអាហារូបករណ៏ នាង ជាមនុស្សខ្មាស់អៀនច្រើនមិនហ៊ាននិយាយចំពោះមនុស្សទូទៅជាច្រើនគ្មានភាពក្លាហ៊ានខ្លាចគេរៀនមិនសូវ ពូកែ ជាប់លេខ​ច្រើន ក្បែរ នាយក ស៊ីញ៉េរហូតនិងមានបំណងចង់បោះបង់ការសិក្សាគិតថាខ្លួនឯងរៀនមិនពូកែ ហើយម៉្យាងទៀតដោយ​សា​​រជីវភាពគ្រួសារ ក្រីក្រពេកឪពុកម្តាយលែងលៈគ្នា ហើយសព្វថ្ងៃនាងរស់នៅជាមួយ ជីដូនចាស់មានជំងឺគ្មានអ្នកមើលថែរនាងចង់ជួយសម្រួល​​ ជីវភាពគ្រួសារ។ ដោយបានការពិន្យល់នែនាំពីរលោកគ្រូនាយកសាលាហើយអោយនាងបានចូលជាសិស្សអាហារូបករណ៏ មក នាងបានតស៊ូបន្តការសិក្សាទៅមុខទាំងក្តីជឿរជាក់ហើយគម្រោងបានបើកកង់សម្ភារៈសិក្សានិងអង្ករបានជួយសម្រួលជីវភាពបានមួយកម្រិតផងដែរនិងជាពិសេសអោយនាងរៀនគួអត់គិតថ្លៃនាងសប្បាយចិត្តណាស់ដែលមានអង្គការជួយដល់នាងដោយឃើញឪកាសនេះហើយទើបនាងប្រឹងប្រែងរៀនអោយបានពូកែ។</p>\r\n\r\n<p>ចាប់តាំងពីនាងទទួលបានអាហារូបករណ៏ក្នុងខែមេសា ឆ្នាំ២០១៧ មក ណាង អេង បានក្លាយជា សិស្សពូកែអាចដឹកនាំគេរៀនជាប្រធានក្លិបសិក្សា ហើយកញ្ញាខិតខំចូលរួមគ្រប់សកម្មភាពរបស់គម្រោង រហូតមានការផ្លាស់ប្ដូរឥរិយាបទជាច្រើនហ៊ានឡើងនិយាយចំពោះមនុស្សច្រើនអាចឡើងកាន់កម្មវិធីក្នុងសកម្មភាពធំៗរបស់គម្រោង និងផ្លាស់ប្តូរទម្លាប់ជាច្រើន​ដើម្បីអភិវឌ្ឍន៍ខ្លួងឯង និងសាលារៀនផងដែរ។នាងចេះជួយមិត្តភក្រ័ដែរទន់ខ្សោយ​​ឲ្យល្អប្រ​សើរដូចនាង ចែករំលែកចំណេះដឹងនិងភាពក្លា​ហា​​​ន​​បទពិសោធន៏ផ្សេងៗទៀតដែលនាងមាននិងជួយបង្រៀនទៅដល់មិត្តភត្រ័ដែរមិនចេះ។ល។</p>', 'post4.jpg', 0, '2018-05-09 09:18:10'),
(5, 'លាហើយការសិក្សាដើម្បីជីវភាពគ្រួសារខ្ញុំ', 'កញ្ញា ណយ ស្រីស្រស់ គឺជាសិស្សម្នាក់ដែរខិតខំរៀនសូត្រចាប់តាំងពីនាងនៅក្មេងមកម្លេះហើយការរៀនសូត្ររបស់នាងក៏មានចំណាត់ថ្នាក់ល្អជាមធ្យមផងដែរ។តែដោយសារកត្តាជីវភាពគ្រួសាររបស់នាងក្រីក្រពេកនាងមានបំណងចង់បោះបង់ការសិក្សាជាច្រើនដង។​', '<p>កញ្ញា ណយ ស្រីស្រស់ ជាសិស្សថ្នាក់ទី១0 C&nbsp;នៃ វិទ្យាល័យ ព្រះបាទនរោត្តម ស្ថិតក្នុងឃុំកញ្ច្រៀច ស្រុកកញ្រ្ជៀច ខេត្តព្រៃវែង មានចម្ងាយ ៦៥គីឡូម៉ែត្រ ពីទីរួមខេត្តព្រៃវែង ។</p>\r\n\r\n<p>កញ្ញា ណយ ស្រីស្រស់ គឺជាសិស្សម្នាក់ដែរខិតខំរៀនសូត្រចាប់តាំងពីនាងនៅក្មេងមកម្លេះហើយការរៀនសូត្ររបស់នាងក៏មានចំណាត់ថ្នាក់ល្អជាមធ្យមផងដែរ។តែដោយសារកត្តាជីវភាពគ្រួសាររបស់នាងក្រីក្រពេកនាងមានបំណងចង់បោះបង់ការសិក្សាជាច្រើនដង។​ បន្ទាប់ពីនាង ទទួលបានអាហារូបករណ៍​ពី​សមាគ​មយុវជនខ្មែរ ក្នុងគម្រោង(លើកកម្ពស់អនាគត​សិស្សស្រីតាមរយៈការអប់រំ) &ldquo;IAGED&rdquo;&nbsp;មកនាងសម្រេចចិត្តតស៊ូរៀនបន្ត រហូតបានចប់ថ្នាក់១០ ហើយនាងបានសម្រេចចិត្តថាត្រូវតែបោះបង់ការសិក្សាចោលទាំងដែលខ្លួនមិនពេញចិត្ត តំរូវតាមជីវភាពគ្រួសាររបស់នាង។</p>\r\n\r\n<p>នាងបានបញ្ជាក់ប្រាប់ថា៖នាងសោកស្តាយខ្លាំងណាស់ដោយបានការជួយឧបត្ថមគាំទ្រពីអង្គការហើយនៅតែមិនបានរៀនបន្តទៀតពីព្រោះតែគ្រួសារខ្ញុំក្រីក្រឪពុកម្តាយបានលែងលះគ្នាបន្សល់នៅកូនកំព្រាបីនាក់នាងខ្ញុំជាកូនស្រីច្បងគេជួយមើលថែទាំប្អូនប្រុសស្រីពីនាក់ទៀត ដោយការលំបាកពេក ម្តាយខ្ញុំក៏ទៅធ្វើការនៅប្រទេសថៃបាត់ទៅនាងខ្ញុំរស់នៅជាមួយអ៊ុំស្រីចាស់ ហើយមានជំងឺដោយសារគ្រោះថ្នាក់ចរាចណ៏ប៉ុន្មានខែមុននឹងធ្វើឲខ្ញុំពិបាកក្នុងការរៀនសូត្របន្តក៏សម្រេចចិត្តបោះ​បង់​​ការសិក្សា ទៅធ្វើការរោងចក្រកាត់ដេរនៅភ្នំពេញជា​មួយបងស្រីជាអ្នកជិតខាង។</p>', 'post5.png', 0, '2018-05-09 09:19:56'),
(6, 'ចាប់ផ្តើមអនាគត់ថ្មីជាមួយក្តីសង្ឃឹម sdf skdfj', 'ជាមួយភាពជឿជាក់នឹងស្នាមញញឹមដ៏អង់អាចក្លាហាន ដែរធ្វើឲ កញ្ញា អេង ធិត គឺជាសិស្សម្នាក់ដែរទទួលបានការកោតសរសើរពីមិត្តភក្រ័និងគ្រួសាររបស់នាងក្រោយពីបានចូលជាសិស្ស អាហារូបករណ៍​ពី​សមាគមយុវជនខ្មែរ គម្រោងលើកកម្ពស់អនាគត​សិស្សស្រីតាមរយៈការអប់រំ', '<p>កញ្ញា អេង ធិត ជាសិស្សថ្នាក់ទី១១B&nbsp;នៃ វិទ្យាល័យ ជាច ស្ថិតក្នុងឃុំជាច ស្រុកកំចាយមារ ខេត្តព្រៃវែង មានចម្ងាយ ៦0&nbsp;គីឡូម៉ែត្រ ពីទីរួមខេត្តព្រៃវែង ។</p>\r\n\r\n<p>ជាមួយភាពជឿជាក់នឹងស្នាមញញឹមដ៏អង់អាចក្លាហាន ដែរធ្វើឲ កញ្ញា អេង ធិត គឺជាសិស្សម្នាក់ដែរទទួលបានការកោតសរសើរពីមិត្តភក្រ័និងគ្រួសាររបស់នាងក្រោយពីបានចូលជាសិស្ស អាហារូបករណ៍​ពី​សមាគមយុវជនខ្មែរ គម្រោងលើកកម្ពស់អនាគត​សិស្សស្រីតាមរយៈការអប់រំ &ldquo;IAGED&rdquo;មកនាងក្លាយជាសិស្សរៀនពូកែ ទាំងផ្នែកភាសាបរទេស និង ខ្មែរនាងទទួលបានចំណាត់​ថ្នាក់លេខ១ ជារាងរាល់ខែ ។ កាលពីមុខមិនទាន់ ចូលជាសិស្សអាហារូបករណ៏ អេង ធិតជាមនុស្សខ្មាស់អៀនច្រើនមិនហ៊ាននិយាយចំពោះមនុស្សច្រើននិងមានបំណងចង់បោះបង់ការសិក្សាដោយសារជីវភាពគ្រួសារ ក្រីក្រពេកហើយ ម្តាយចាស់មានជំងឺនាងចង់ជួយសំរាល់ជីវភាពគ្រួសារ ដោយបានការពិន្យល់នែនាំពីរលោកគ្រូអ្នកគ្រូនាងបន្តការសិក្សាទាំងមិនពេញចិត្ត។&nbsp;ចាប់តាំងពីនាងទទួលបានអាហារូបករណ៏ក្នុងខែមេសា ឆ្នាំ២០១៧ មក អេង ធិត បានក្លាយជាប្រធានក្លឹបសិក្សា&nbsp;TGS(Team good student)ហើយកញ្ញាខិតខំចូលរួមគ្រប់សកម្មភាព របស់គម្រោង រហូតមានការផ្លាស់ប្ដូរឥរិយាបទ និងទម្លាប់ជាច្រើន​ដើម្បីអភិវឌ្ឍន៍ខ្លួងឯង និងសាលារៀនផងដែរ។នាងចេះជួយមិត្តភក្រ័ដែរទន់ខ្សោយឲល្អប្រ​សើរដូចនាង ចែករំលែកចំណេះដឹងនិងភាពក្លា​ហា​​​ន​​បទពិសោធន៏ផ្សេងៗទៀតដែលនាងមាន។</p>\r\n\r\n<p>បន្ទាប់ពីដំណើរទស្សនៈកិច្ចសិក្សា ការប្រជុំក្លឹប​ប្រចាំ​សប្តាហ៏ នាងទទួលបានលទ្ធផលល្អប្រសើរឡើងជារាងរាល់ថ្ងៃក្លាយជាមនុស្សចេះស្រលាញ់ការសិក្សាក្លាហានហ៊ានសួរហ៊ាននិយាយក្នុង&nbsp;ចំណោម​មនុស្សជាច្រើននិងបង្កើតគំនិតថ្មីៗជួយដល់សង្គមនិងគ្រួសារ។ នាងដឹកនាំសិស្សមួយចំនួនបែងចែកប្លង់សំអាតទីធា្លសាលាជាប្រចាំ&nbsp;មានផែនការអនាគតច្បាស់លាស់។&nbsp;ដោយមើលឃើញភាពអង្គអាចក្លាហាន នឹងភាពជាគម្រូ​របស់នាង មិត្តភ័ក្ដិរួមសាលា​បានកោតសរសើរការ ផ្លាស់ប្តូរឥរិយាបទ និងកាខិតខំប្រឹងប្រែងរៀនសូក្រ ធ្វើឲ្យ មិត្តភក្រ័ រួមថ្នាក់ ​អញ្ជើញ នាង អោយជួយពន្យល់មេរៀននិងរៀនតាមទង្វើរបស់នាង នៅពេលទំនេរពីការសិក្សា និងចង់ចូលរួមជាមួយសកម្មភាពរបស់​កញ្ញាផងដែរ ។&nbsp;អាណាព្យាបាលរបស់ អេង ធិត រីករាយ​ដែលបានឃើញកូនស្រីខិតខំប្រឺងប្រែងរៀនសូត្រនិងជួយដល់សង្គមក៏ដូចមិត្តរបស់នាងគាត់រំភើបជាខ្លាំងដោយឃើញកូនស្រីមានគោលដៅច្បាស់លាស់ពេលអនាគត់។&nbsp;លោកគ្រូ សឿន សេង នាយករងវិទ្យាល័យ​​​​​ជាចមានប្រសាសន៍ថាបន្ទាប់ពី​​​សាលាទទួលបានអាហារូបករណ៍មកលោកមានចិត្តសប្បាយរីករាយមែនទែនដោយ&nbsp;ឃើញសិស្សដែរទទួលបានអាហារូបករណ៏ទាំងអស់របស់គម្រោង(លើកកម្ពស់អនាគត់សិស្សស្រីតាមរយៈការអប់រំ)មានការផ្លាស់ប្តូរ​​ឥរិយាបទចេះស្រលាញ់និងជួយគ្នាទៅវិញទៅមកមានភាពក្លាហានចូលរួមគ្រប់សកម្មភាពក្នុងសាលាបានជាច្រើនហើយធ្វើអ្វីដោយមានភាពជាម្ចាស់ការមានភាពជាអ្នកដឹកនាំ ជាពិសេសចេះកែប្រែសោភ័ណ្ឌភាពក្នុងបណ្ណាល័យទីធ្លាសាលាបានយ៉ាងស្អាតហើយគម្រោង​បាននាំមកនូវសកម្មភាពប្លែកៗ សម្រាប់​សាលា ជាពិសេស វេទិកាស្ដីពីការងារ យុទ្ធនាការក្នុងសាលា អាហារូបករណ៍លើកកម្ពស់ភាពជាអ្នកដឹកនាំ។ល។</p>', 'post6.jpg', 0, '2018-05-09 09:21:09'),
(7, 'យុវជនស្មាក់ចិត្តជួយដល់ប្រជាតស៊ូខ្ពស់ ដើម្បី ការសិក្សារបស់នាងទទួលបាន ជោគជ័យដោយការ ខិតខំប្រឹងប្រែងទាំងការរៀន', 'ជាមួយ ស្នាមញញឹម ប្រកបដោយភាពជឿជាក់សារ​​ជាថ្មី របស់ បេទ សីហា គឺជាសិស្សម្នាក់ដែរមានការ​ តស៊ូខ្ពស់ ដើម្បី ការសិក្សារបស់ខ្លួនតាំងពីរតូចនិង​ប្រកបដោយ​ភាពក្លា​ហាន​ហ៊ានចូលរួមគ្រប់សកម្មភាព', '<p><strong>ប្អូនប្រុស បេទ សីហា ជាសិស្សថ្នាក់ទី១២&nbsp;B&nbsp;នៃ វិទ្យាល័យ អង្គរសរ ស្ថិតក្នុងឃុំអង្គរសរ ស្រុកមេសាង ខេត្តព្រៃវែង មានចម្ងាយ ៦០គីឡូម៉ែត្រ ពីទីរួមខេត្តព្រៃវែង ។</strong></p>\r\n\r\n<p>ជាមួយ ស្នាមញញឹម ប្រកបដោយភាពជឿជាក់សារ​​ជាថ្មី របស់ បេទ សីហា គឺជាសិស្សម្នាក់ដែរមានការ​ តស៊ូខ្ពស់ ដើម្បី ការសិក្សារបស់ខ្លួនតាំងពីរតូចនិងប្រកបដោយភាពក្លាហានហ៊ានចូលរួមគ្រប់សកម្មភាពរបស់អង្គការសីហាគឺជាក្មេងប្រុសម្នាក់ទទួលបាន ជោគជ័យដោយការ ខិតខំប្រឹងប្រែងទាំងការរៀនសូត្រនិងឆ្លៀតរកការងារក្រៅម៉ោងដើម្បីយកកំរៃមករៀនបន្ត​ ជាពិសេសសីហា ចូលរួមស្មាក់ចិត្តជាមួយសមាគមយុវជនខ្មែរដើម្បីយកបទពិសោធន៏និងចំណេះដឹងទៅចែករំលែកពត៌មានសំខាន់ៗទៅដល់ប្រជាពលរដ្ឋក្នុងសហគមន៏ សីហា មានការប្តេផ្ញាខ្ពស់ក្នុងការរៀនសូត្រជាមួយសមាគមយុវជនខ្មែរដើម្បីទទួលបានចំនេះដឹងទៅចែករំលែកដល់ប្រជាជនក្នុងសហគមន៏របស់ខ្លួន សីហាមានការកោតសរសើរពីមិត្តភក្រ័ជាច្រើនក្រោយពីបានចូលជាសិស្ស ឆ្នើមនិងជាបណ្តាញរបស់ សមាគមយុវជនខ្មែរ គម្រោងទេសន្តប្រវេសដ៏ឆ្លាតវៃនិងប្រឆាំងអំពើជួញដូរមនុស្ស។សីហា ជាបណ្តាញយុវជនស្មាក់ចិត្តប្រចាំឃុំ អង្គសរ គាត់ ស្មាក់ចិត្តផង រៀន ផង រកចំណូលជួយគ្រួសារផង ។ ពេលសីហាចូលជា&nbsp;បណ្តាញរបស់សមាគមយុវជនខ្មែរ បានចូលរួមជួយគ្រប់សកម្មភាពទាំងអស់ដូចជាៈការជួយសម្របសម្រួលយុទ្ធនាការអប់រំផ្សព្វផ្សាយតាមសាលាការផ្សព្វផ្សាយដល់មិត្តភត្រ័អំពីរការធ្វើចំណាកស្រុកដ៏ឆ្លាតវៃចូលរួមផ្សព្វផ្សាយចន្ល័តក្នុងសហគមន៏ប្រជុំជាមួយអជ្ញាធរមូលដ្ឋាននិងជាមួយប្រជាពលរដ្ឋក្នុងសហគមន៏របស់ខ្លួនផងដែរ។ដោយឃើញថានៅក្នុងភូមិរបស់សីហាមានការចាញ់បោកគេជាច្រើនតាមរយៈការមិនដឹងពីរពត៌មានច្បាស់លាស់ការចាក់ចេញពីស្រុកដោយប្រថុយប្រថាន​​ សីហាឃើញដូច្នោះក៏មានចិត្តចង់ជួយដល់ប្រជាពលរដ្ឋនៅសហគមន៏។នៅពេលដែរសមាគមយុវជនខ្មែរជ្រើរើសអ្នកស្មាក់ចិត្តធ្វើជាបណ្តាញសហគមន៏ សីហាក៏បានស្មាក់ចិត្តមុខគេ ហើយប្រលងជាប់ទៅរៀនវគ្គបណ្តុះបណ្តាលនៅភ្នំពេ​ញ។ពេលសីហាត្រឡប់មកវិញបានផ្សព្វផ្សាយនិងចែករំលែកពត៌មាន ដែរខ្លួនបានដឹងនិងរៀនសូត្រពីរសមាគមយុវជនខ្មែទៅចែករំលែកដល់មិត្តភត្រ័ក៏ដូចជាប្រជាពលរដ្ឋអោយបានដឹងនិងចេះការពារខ្លួនពីការចាញ់បោកគេនិងបានបញ្ជាក់លេខទូរសព្ទ័តាមរយៈសៀវភៅចំណាកស្រុកដ៏ឆ្លាតវៃរបស់គម្រោង ទេសន្តប្រវេសដ៏ឆ្លាតវៃនិងប្រឆាំងអំពើជួញដូរមនុស្ស។ចាប់តាំងពីសីហាបានស្មាក់ចិត្តជួយផ្សព្វផ្សាយពត៌មានទៅដល់ប្រជាពលរដ្ឋបានមួយចំនួនធំយល់ដឹងចេះការពារខ្លួនពីការចាញ់បោកគេ។សម្រាបប្រជាពលរដ្ឋបានកោតសរសើរសីហាមិនដាច់ពីមាត់ថា ក្មេងឆ្លាតនិងពូកែមិត្តភត្រសីហាឃើញដូច្នេះក៏មានចិត្តចង់ចូលរួមស្មាក់ចិត្តនៅសមាគមយុវជនខ្មែរជាច្រើនអ្នកផងដែរ។សីហានៅតែបន្តស្មាក់ចិត្តនិងចែករំលែកចំណេះដឹកទៅអ្នកដទៃរហូតបើមានបញ្ហា។មកដល់ឥឡូវនេះសីហានៅតែបន្តស្មាក់ចិត្តជាមួយអង្គការដទៃដើម្បីទទួលបានបទពិសោធន៏ថ្មីៗ សីហាបានចូលជាប្រធានក្រុមយុវជនប្រចាំឃុំអង្គរសររបស់អង្គការ&nbsp;Word Vision&nbsp;គាត់បានចែករំលែកពត៌មានជាក់ស្តែងពីការធ្វើចំណាកស្រុកដោយប្រថុយប្រថាននិងលើយកសៀវភៅរួមគ្នាការពារខ្លួន​ និងសហគមន៏យើងឲ្យផុតពីអំពើជួញដូរមនុស្ស របស់សមាគមយុវជនខ្មែរទៅចែករំលែកនៅក្នុងកម្មវិធី ការធ្វើចំណាកស្រុកដោយអសុវត្ថិភាព និងការប្រើអំពើ​​&nbsp;ហឹង្សាក្នុងគ្រួសាររបស់គម្រោង អង្គការ​&nbsp;Word Vision&nbsp;ប្រជាពលរដ្ឋចំនួន៣០០នាក់ទទួលបានពត៌មានយ៉ាងជាក់លាក់ពីសីហា។&nbsp;មិត្តភត្ររបស់សីហាបាននិយាយថាការចូលជាបណ្តាញរបស់សមាគមយុវជនខ្មែរគឺតំរូវឲ្យយើងមានភាពក្លាហាននិងទទួលបានចំណេះដឹងជាច្រើននិងកោតសរសើរដល់សីហាមាន ការ ផ្លាស់ប្តូរឥរិយាបទ និងកាខិតខំប្រឹងប្រែងរៀនសូក្រ ធ្វើឲ្យមិត្តភក្រ័ រួមថ្នាក់ ក៏ដូចរួមសាលាច្រណែននិងសរសើរសីហាជាខ្លាំង។</p>', 'post7.jpg', 0, '2018-05-09 09:21:55'),
(8, 'តស៊ូក្នងការសិក្សាដើម្បីមអនាគត់ខ្ញុំតស៊ូខ្ពស់ ដើម្បី ការសិក្សារបស់នាងទទួលបាន ជោគជ័យដោយការ', 'ជាមួយ ស្នាមញញឹម ប្រកបដោយភាពជឿជាក់សារ​​ជាថ្មី របស់ កញ្ញា រ៉ូយ ស៊ានលីន គឺជាសិស្សម្នាក់ដែរមានការ​ តស៊ូខ្ពស់ ដើម្បី ការសិក្សារបស់នាងទទួលបាន ជោគជ័យដោយការ ខិតខំប្រឹងប្រែងទាំង', '<p><strong>កញ្ញា រ៉ូយ ស៊ានលីន ជាសិស្សថ្នាក់ទី១១&nbsp;B&nbsp;នៃ វិទ្យាល័យ ព្រះបាទនរោត្តម ស្ថិតក្នុងឃុំកញ្ជៀច ស្រុកកញ្ជ្រៀច ខេត្តព្រៃវែង មានចម្ងាយ ៦៥គីឡូម៉ែត្រ ពីទីរួមខេត្តព្រៃវែង ។</strong></p>\r\n\r\n<p>ជាមួយ ស្នាមញញឹម ប្រកបដោយភាពជឿជាក់សារ​​ជាថ្មី របស់ កញ្ញា រ៉ូយ ស៊ានលីន គឺជាសិស្សម្នាក់ដែរមានការ​ តស៊ូខ្ពស់ ដើម្បី ការសិក្សារបស់នាងទទួលបាន ជោគជ័យដោយការ ខិតខំប្រឹងប្រែងទាំងការរៀនសូត្រនិងឆ្លៀតរកការងារក្រៅម៉ោងដើម្បីយកកំរៃមករៀនបន្ត​ ការកោតសរសើរពីមិត្តភក្រ័និងគ្រួសាររបស់នាងក្រោយពីបានចូលជាសិស្ស អាហារូបករណ៍​ពី​សមាគមយុវជនខ្មែរ គម្រោងលើកកម្ពស់អនាគត​សិស្សស្រីតាមរយៈការអប់រំ &ldquo;IAGED&rdquo;មកនាងក្លាយជាសិស្សរៀនពូកែ ទាំងផ្នែកភាសាបរទេស និង ខ្មែរនាងទទួលបានចំណាត់​ថ្នាក់លេខ១ ជារាងរាល់ខែ ។ កាលពីមុខមិនទាន់ ចូលជាសិស្សអាហារូបករណ៏ អេង ធិតជាមនុស្សខ្មាស់អៀនច្រើនមិនហ៊ាននិយាយចំពោះមនុស្សច្រើននិងមានបំណងចង់បោះបង់ការសិក្សាដោយសារជីវភាពគ្រួសារ ក្រីក្រពេកហើយ ម្តាយចាស់មានជំងឺនាងចង់ជួយសំរាល់ជីវភាពគ្រួសារ ដោយបានការពិន្យល់នែនាំពីរលោកគ្រូអ្នកគ្រូនាងបន្តការសិក្សាទាំងមិនពេញចិត្ត។</p>\r\n\r\n<p>ចាប់តាំងពីនាងទទួលបានអាហារូបករណ៏ក្នុងខែមេសា ឆ្នាំ២០១៧មក អេង ធិត បានក្លាយជាប្រធានក្លឹបសិក្សា&nbsp;TGS(Team good student)ហើយកញ្ញាខិតខំចូលរួមគ្រប់សកម្មភាព របស់គម្រោង រហូតមានការផ្លាស់ប្ដូរឥរិយាបទ និងទម្លាប់ជាច្រើន​ដើម្បីអភិវឌ្ឍន៍ខ្លួងឯង និងសាលារៀនផងដែរ។នាងចេះជួយមិត្តភក្រ័ដែរទន់ខ្សោយឲល្អប្រ​សើរដូចនាង ចែករំលែកចំណេះដឹងនិងភាពក្លា​ហា​​​ន​​បទពិសោធន៏ផ្សេងៗទៀតដែលនាងមាន&nbsp;បន្ទាប់ពីដំណើរទស្សនៈកិច្ចសិក្សា ការប្រជុំក្លឹប​ប្រចាំ​សប្តាហ៏ នាងទទួលបានលទ្ធផលល្អប្រសើរឡើងជារាងរាល់ថ្ងៃក្លាយជាមនុស្សចេះស្រលាញ់ការសិក្សាក្លាហានហ៊ានសួរហ៊ាននិយាយក្នុង&nbsp;ចំណោម​មនុស្សជាច្រើននិងបង្កើតគំនិតថ្មីៗជួយដល់សង្គមនិងគ្រួសារ។ នាងដឹកនាំសិស្សមួយចំនួនបែងចែកប្លង់សំអាតទីធា្លសាលាជាប្រចាំ&nbsp;មានផែនការអនាគតច្បាស់លាស់។&nbsp;ដោយមើលឃើញភាពអង្គអាចក្លាហាន នឹងភាពជាគម្រូ​របស់នាង មិត្តភ័ក្ដិរួមសាលា​បានកោតសរសើរការ ផ្លាស់ប្តូរឥរិយាបទ និងកាខិតខំប្រឹងប្រែងរៀនសូក្រ ធ្វើឲមិត្តភក្រ័ រួមថ្នាក់ ​អញ្ជើញ នាង អោយជួយពន្យល់មេរៀននិងរៀនតាមទង្វើរបស់នាង នៅពេលទំនេរពីការសិក្សា និងចង់ចូលរួមជាមួយសកម្មភាពរបស់​កញ្ញាផងដែរ ។&nbsp;អាណាព្យាបាលរបស់ អេង ធិត រីករាយ​ដែលបានឃើញកូនស្រីខិតខំប្រឺងប្រែងរៀនសូត្រនិងជួយដល់សង្គមក៏ដូចមិត្តរបស់នាងគាត់រំភើបជាខ្លាំងដោយឃើញកូនស្រីមានគោលដៅច្បាស់លាស់ពេលអនាគត់។&nbsp;លោកគ្រូ សឿន សេង នាយករងវិទ្យាល័យ​​​​​ជាចមានប្រសាសន៍ថាបន្ទាប់ពី​​​សាលាទទួលបានអាហារូបករណ៍មកលោកមានចិត្តសប្បាយរីករាយមែនទែនដោយ&nbsp;ឃើញសិស្សដែរទទួលបានអាហារូបករណ៏ទាំងអស់របស់គម្រោង(លើកកម្ពស់អនាគត់សិស្សស្រីតាមរយៈការអប់រំ)មានការផ្លាស់ប្តូរ​​ឥរិយាបទចេះស្រលាញ់និងជួយគ្នាទៅវិញទៅមកមានភាពក្លាហានចូលរួមគ្រប់សកម្មភាពក្នុងសាលាបានជាច្រើនហើយធ្វើអ្វីដោយមានភាពជាម្ចាស់ការមានភាពជាអ្នកដឹកនាំ ជាពិសេសចេះកែប្រែសោភ័ណ្ឌ&nbsp;ភាពក្នុងបណ្ណាល័យទីធ្លាសាលាបានយ៉ាងស្អាត&nbsp;ហើយគម្រោង​បាននាំមកនូវសកម្មភាពប្លែកៗ សម្រាប់​សាលា ជាពិសេស វេទិកាស្ដីពីការងារ យុទ្ធនាការក្នុងសាលា អាហារូបករណ៍លើកកម្ពស់ភាពជាអ្នកដឹកនាំ។ល។</p>', 'post8.jpg', 0, '2018-05-09 09:22:50'),
(9, 'Ministry Construction', 'Lorem ipsum dolor sit amet', '<p>test</p>', 'post9.jpg', 1, '2018-05-09 16:33:19'),
(10, '45 Floor Project in Phnom Penh', 'Lorem ipsum dolor sit amet', '<p>Lorem ipsum dolor sit amet</p>', 'post10.jpg', 1, '2018-05-09 16:46:21'),
(11, 'Some New Project in Province', 'Lorem ipsum dolor sit amet', '<h5><a href=\"http://localhost:8000/#\"><strong>Lorem ipsum dolor sit amet</strong></a></h5>', 'post11.jpg', 1, '2018-05-09 16:47:00'),
(12, 'High Structured Bending Project', 'Lorem ipsum dolor sit amet', '<p>Lorem ipsum dolor sit amet</p>', 'post12.jpeg', 1, '2018-05-09 16:48:33'),
(13, '12 FLOORS PROJECT', 'Lorem ipsum dolor sit amet', '<p>test</p>', 'post13.jpg', 0, '2018-05-09 16:49:05'),
(14, 'test 5', 'test', '<p>test</p>', 'post14.jpg', 0, '2018-05-09 16:49:25'),
(15, 'Hello World', 'Test', '<p>Test</p>', 'post15.jpg', 0, '2018-05-27 13:04:14'),
(16, 'Hello World Project', 'Some short description here', NULL, 'post16.jpg', 1, '2018-05-27 13:38:11'),
(17, 'Hello Construction Project', 'Hello World!', 'Some description here...', 'post17.jpg', 1, '2018-05-27 13:39:48');

-- --------------------------------------------------------

--
-- Table structure for table `main_menus`
--

CREATE TABLE `main_menus` (
  `id` int(11) NOT NULL,
  `name` varchar(220) NOT NULL,
  `url` varchar(250) DEFAULT '#',
  `order_number` int(11) DEFAULT '0',
  `active` tinyint(4) NOT NULL DEFAULT '1',
  `create_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `main_menus`
--

INSERT INTO `main_menus` (`id`, `name`, `url`, `order_number`, `active`, `create_at`) VALUES
(1, '11', NULL, NULL, 0, '2018-03-13 04:16:10'),
(2, 'asdffffakkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkksdafa;sdfhasdfhaskdfjas;dfjas;dljfas;dfj;asdfjsdfj', NULL, NULL, 0, '2018-03-13 04:16:24'),
(3, '123455555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555555tghjkl;;kjhgfghjk;kjhgfh;kjhdghjkl;;hxcvbn/c;d kl;', NULL, NULL, 0, '2018-03-13 04:16:39'),
(4, 'Hello WOrld', 'www.vdoo.biz', 8, 0, '2018-03-13 04:18:00'),
(5, '11', NULL, 111, 0, '2018-03-13 04:22:10'),
(6, 'Portfolio', '#', 3, 1, '2018-03-13 04:22:44'),
(7, 'Services', '#', 2, 1, '2018-03-13 04:23:23'),
(8, 'Home', '/', 1, 1, '2018-03-13 04:43:06'),
(9, 'Projects', '/category/13', 4, 1, '2018-05-09 11:45:16'),
(10, 'Testimonials', '#', 5, 1, '2018-05-09 11:45:29'),
(11, 'Contact Us', 'page/2', 6, 1, '2018-05-09 11:45:54'),
(12, 'About Us', 'page/1', 8, 1, '2018-05-09 11:46:02');

-- --------------------------------------------------------

--
-- Table structure for table `our_services`
--

CREATE TABLE `our_services` (
  `id` int(11) NOT NULL,
  `title` varchar(40) NOT NULL,
  `qoute` varchar(90) DEFAULT NULL,
  `description` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `our_services`
--

INSERT INTO `our_services` (`id`, `title`, `qoute`, `description`) VALUES
(1, 'OUR SERVICES', '11 YEARS OF EXPERTISE', 'Engineering Construction and Consultant has had professional in construction, acrchitectural design, structural desgin. Construction focuses mainly on quality, aesthetics and economic and project owners, in particular, must have constants with enough experience and expertise in building with many high rise buildings such as condominiums, apartments, hotels, commercial building, office space, building and basement parking.');

-- --------------------------------------------------------

--
-- Table structure for table `pages`
--

CREATE TABLE `pages` (
  `id` int(11) NOT NULL,
  `title` varchar(120) NOT NULL,
  `description` longtext,
  `active` tinyint(4) NOT NULL DEFAULT '1',
  `url` varchar(200) NOT NULL DEFAULT '#',
  `create_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `featured_image` varchar(200) NOT NULL DEFAULT 'default.png'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `pages`
--

INSERT INTO `pages` (`id`, `title`, `description`, `active`, `url`, `create_at`, `featured_image`) VALUES
(1, 'About Us', '<p>About Us Description</p>', 1, '#', '2018-05-22 03:09:22', 'page1.jpg'),
(2, 'Contact Us', '<p>Contuct Us Description</p>', 1, '#', '2018-05-22 03:13:38', 'page2.jpg'),
(3, 'Construction Consulting', '<p>This is consulting page</p>', 1, '#', '2018-05-27 17:52:52', 'default.png'),
(4, 'Partnerships', '<p>Description here...</p>', 1, '#', '2018-05-29 13:14:57', 'default.png'),
(5, 'Terms of Use', '<p>Description here...</p>', 1, '#', '2018-05-29 13:15:11', 'default.png'),
(6, 'Privacy Policy', '<p>Description Here...</p>', 1, '#', '2018-05-29 13:15:26', 'default.png'),
(7, 'Appartment', '<p>Some description....</p>', 1, '#', '2018-06-08 08:04:26', 'default.png'),
(8, 'Condo', '<p>Some descripition should be here...</p>', 1, '#', '2018-06-08 08:05:25', 'default.png'),
(9, 'Hotel', '<p>some description for hotel service page</p>', 1, '#', '2018-06-08 08:06:06', 'default.png'),
(10, 'Office Building', '<p>put your content here...</p>', 1, '#', '2018-06-08 08:07:38', 'default.png'),
(11, 'Business Building', '<p>put description here..</p>', 1, '#', '2018-06-08 08:07:52', 'default.png');

-- --------------------------------------------------------

--
-- Table structure for table `partners`
--

CREATE TABLE `partners` (
  `id` int(11) NOT NULL,
  `name` varchar(90) NOT NULL,
  `logo` varchar(90) NOT NULL DEFAULT 'default.png',
  `sequence` int(11) DEFAULT '0',
  `url` varchar(120) DEFAULT NULL,
  `active` tinyint(4) NOT NULL DEFAULT '1',
  `create_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `partners`
--

INSERT INTO `partners` (`id`, `name`, `logo`, `sequence`, `url`, `active`, `create_at`) VALUES
(1, 'Vdoo', 'ACTED.png', 3, 'http://www.vdoo.biz', 1, '2017-08-15 15:09:57'),
(2, 'Dell', 'dell.jpg', 2, '#', 0, '2017-08-15 15:10:36'),
(3, 'EA', 'logo1-min.png', 1, '#', 0, '2017-08-15 15:11:14'),
(4, 'Adidas', 'adidas.jpg', 1, '#', 0, '2017-08-15 15:54:27'),
(5, 'ATech', '777262-bigthumbnail.jpg', -3, NULL, 0, '2017-08-15 15:55:02'),
(6, 'Samnang Finance Plc', 'ការណាតជួបថ្នាក់ដឹកនាំជានខ្ពស់.jpg', -4, NULL, 0, '2017-10-31 09:10:42'),
(7, 'Dream House', 'ការណាតជួបថ្នាក់ដឹកនាំជានខ្ពស់.jpg', -4, NULL, 0, '2017-11-29 01:26:32'),
(8, 'Green Café', 'Green Cafe Logos OK.png', 6, NULL, 0, '2017-11-29 01:30:45'),
(9, 'Green Café', 'Green Cus.jpg', -5, NULL, 0, '2017-11-29 01:45:23'),
(10, 'Green Café', 'To to.jpg', -4, NULL, 0, '2017-11-29 01:52:00'),
(11, 'LP GAS', 'Co co to.png', 10, NULL, 0, '2017-11-29 04:35:16'),
(12, 'Khmer Capital Microfinance', 'សម្តេចធ្វើការប្រជុំ.jpg', -6, NULL, 0, '2017-11-29 04:40:12'),
(13, 'fdf', '2017-10-24_113639 copy.png', -7, NULL, 0, '2017-11-29 04:46:02'),
(14, '11', 'photo_2017-12-09_17-04-10.jpg', 1, '11', 0, '2017-12-12 09:16:13'),
(15, 'atest', 'photo_2017-12-09_17-04-10.jpg', NULL, NULL, 0, '2017-12-12 09:20:28'),
(16, '1111', 'សម្តេចធ្វើកិច្ចពីភាក្សា.jpg', NULL, NULL, 0, '2017-12-12 09:21:53'),
(17, 'Development Innovation', 'logo.png', 1, 'http://www.development-innovations.org/', 0, '2018-03-01 02:08:41'),
(18, 'USAID', 'logo-en.png', 2, 'https://www.usaid.gov/cambodia', 0, '2018-03-01 02:10:04'),
(19, 'CCC Cambodia', 'ccc-logo.png', 3, 'http://www.ccc-cambodia.org/kh', 0, '2018-03-01 02:10:55'),
(20, 'Acted', '1-min.png', 0, '#', 0, '2018-03-01 04:35:58'),
(21, 'ANSA', 'Daroath-Phav-2-e1502177453250.jpg', 0, '#', 0, '2018-03-01 04:36:13'),
(22, 'Christian Aids', '5-min.png', 0, '#', 0, '2018-03-01 04:36:34'),
(23, 'Forum Syd', '7-min.png', 0, '#', 0, '2018-03-01 04:37:04'),
(24, 'Winrok', '10-min.png', 0, '#', 0, '2018-03-01 04:37:17'),
(25, 'Elitronic Shop', 'UNICEF_Logo.png', 0, NULL, 1, '2018-05-09 17:37:18'),
(26, 'test', '6-min.png', 0, NULL, 1, '2018-05-09 17:46:26'),
(27, 'test', 'Plan.png', 0, NULL, 1, '2018-05-09 17:48:03'),
(28, '1', '3-min.png', 0, NULL, 1, '2018-05-09 17:48:32'),
(29, 'test', '7-min.png', 0, NULL, 1, '2018-05-09 17:49:08');

-- --------------------------------------------------------

--
-- Table structure for table `permissions`
--

CREATE TABLE `permissions` (
  `id` int(11) NOT NULL,
  `name` varchar(90) NOT NULL,
  `list` tinyint(4) NOT NULL DEFAULT '0',
  `insert` tinyint(4) NOT NULL DEFAULT '0',
  `update` tinyint(4) NOT NULL DEFAULT '0',
  `delete` tinyint(4) NOT NULL DEFAULT '0'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Dumping data for table `permissions`
--

INSERT INTO `permissions` (`id`, `name`, `list`, `insert`, `update`, `delete`) VALUES
(2, 'Main Menu', 0, 0, 0, 0),
(3, 'Sub Menu', 0, 0, 0, 0),
(4, 'Slideshow', 0, 0, 0, 0),
(5, 'Page', 0, 0, 0, 0),
(6, 'Featured Work', 0, 0, 0, 0),
(7, 'Video', 0, 0, 0, 0),
(8, 'Current Project', 0, 0, 0, 0),
(9, 'Advertisement', 0, 0, 0, 0),
(10, 'Portfolio', 0, 0, 0, 0),
(11, 'Company Feature', 0, 0, 0, 0),
(13, 'Partner', 0, 0, 0, 0),
(14, 'File Manager', 0, 0, 0, 0),
(16, 'User', 0, 0, 0, 0),
(17, 'Role', 0, 0, 0, 0),
(18, 'Post Category', 0, 0, 0, 0),
(25, 'Permission', 0, 0, 0, 0),
(26, 'Social', 0, 0, 0, 0),
(27, 'Portfolio Category', 0, 0, 0, 0),
(28, 'Post', 0, 0, 0, 0);

-- --------------------------------------------------------

--
-- Table structure for table `portfolios`
--

CREATE TABLE `portfolios` (
  `id` int(11) NOT NULL,
  `name` text NOT NULL,
  `photo` varchar(80) NOT NULL DEFAULT 'default.png',
  `create_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `active` tinyint(4) DEFAULT '1',
  `order` tinyint(4) DEFAULT '0',
  `category_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `portfolios`
--

INSERT INTO `portfolios` (`id`, `name`, `photo`, `create_at`, `active`, `order`, `category_id`) VALUES
(1, 'test', 'default.png', '2018-05-21 07:33:35', 0, 0, 1),
(2, 'test', 'default.png', '2018-05-21 07:33:47', 0, 0, 1),
(3, 'Sample Portfolio of the construction site', 'portfolios3.jpeg', '2018-05-21 07:34:24', 0, 0, 1),
(4, 'google', 'portfolios4.jpeg', '2018-05-21 07:34:51', 0, 1, 1),
(5, 'test', 'portfolios5.jpeg', '2018-05-21 07:35:32', 0, 1, 1),
(6, 'Hello World', 'portfolios6.jpg', '2018-05-27 12:49:08', 0, 3, 1),
(7, 'Image 1', 'portfolios7.png', '2018-05-27 12:50:35', 1, 1, 1),
(8, 'Image 2', 'portfolios8.png', '2018-05-27 12:53:51', 1, 2, 1),
(9, 'Image 1', 'portfolios9.jpg', '2018-05-27 12:54:12', 1, 1, 6),
(10, 'Image 2', 'portfolios10.jpg', '2018-05-27 12:54:28', 1, 2, 6),
(11, 'Image 1', 'portfolios11.png', '2018-05-27 12:54:50', 1, 1, 7),
(12, 'Image 2', 'portfolios12.png', '2018-05-27 12:55:10', 1, 2, 7),
(13, 'Image 1', 'portfolios13.png', '2018-05-27 12:55:30', 1, 1, 3);

-- --------------------------------------------------------

--
-- Table structure for table `portfolio_categories`
--

CREATE TABLE `portfolio_categories` (
  `id` int(11) NOT NULL,
  `name` varchar(90) NOT NULL,
  `active` bit(1) NOT NULL DEFAULT b'1',
  `create_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `order_number` int(11) NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `portfolio_categories`
--

INSERT INTO `portfolio_categories` (`id`, `name`, `active`, `create_at`, `order_number`) VALUES
(1, 'Building Construction', b'1', '2018-05-21 06:40:44', 1),
(2, 'Service', b'0', '2018-05-21 06:41:11', 0),
(3, 'School Construction', b'1', '2018-05-21 06:43:17', 2),
(4, 'vichey', b'0', '2018-05-21 06:43:22', 0),
(5, 'test 4', b'0', '2018-05-21 06:43:37', 0),
(6, 'Hotel Construction', b'1', '2018-05-21 06:44:58', 3),
(7, 'Residential Construction', b'1', '2018-05-27 12:53:24', 5);

-- --------------------------------------------------------

--
-- Table structure for table `posts`
--

CREATE TABLE `posts` (
  `id` int(11) NOT NULL,
  `title` varchar(220) NOT NULL,
  `short_description` text,
  `description` longtext,
  `featured_image` varchar(200) DEFAULT NULL,
  `active` tinyint(4) NOT NULL DEFAULT '1',
  `create_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `category_id` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `posts`
--

INSERT INTO `posts` (`id`, `title`, `short_description`, `description`, `featured_image`, `active`, `create_at`, `category_id`) VALUES
(1, 'Sample News Title From Developer Team', 'Some description of your news can be written here...', '<p>Some articile should be here...</p>', 'post1.jpg', 1, '2018-05-09 08:47:50', 10),
(2, 'ទម្រង់ប្រមូលករណីសិក្សាលើ សម្មភាពមិត្តអប់រំមិត្ត ស្តីពីសុខភាពបន្តពូជt1', 'ឈ្មោះអ្នកផ្តល់សម្ភាសន៍ សល់ ធូ ភេទ ស្រី អាយុ១៥ មុខរបរ មិត្តអប់រំមិត្ត (សិស្ស) ថ្នាក់ទី៦ សាលាបឋមសិក្សាអ៊ីន អាស័យដ្ឋាននៅ ភូមិ អ៊ីន ឃុំ តាឡាវ ស្រុក អណ្តូងមាស ខេត្ត រតនគិរី ។', '<p><strong>កាលបរិច្ឆេទ ២៩ ខែមីនា ឆ្នាំ ២០១៧</strong></p>\r\n\r\n<p>ឈ្មោះអ្នកផ្តល់សម្ភាសន៍&nbsp;<strong>សល់ ធូ</strong>&nbsp;ភេទ&nbsp;<strong>ស្រី</strong>&nbsp;អាយុ<strong>១៥</strong>&nbsp;មុខរបរ&nbsp;<strong>មិត្តអប់រំមិត្ត</strong>&nbsp;(<strong>សិស្ស</strong><strong>)</strong>&nbsp;ថ្នាក់ទី<strong>៦</strong>&nbsp;សាលាបឋមសិក្សា<strong>អ៊ីន</strong>&nbsp;អាស័យដ្ឋាននៅ ភូមិ&nbsp;<strong>អ៊ីន</strong>&nbsp;ឃុំ&nbsp;<strong>តាឡាវ</strong>&nbsp;ស្រុក&nbsp;<strong>អណ្តូងមាស</strong>&nbsp;ខេត្ត<strong>រតនគិរី</strong>&nbsp;។&nbsp;ប្អូនស្រី&nbsp;<strong>សល់ ធូ</strong>&nbsp;បានមានប្រសាសន៍ដោយលើកឡើងថា កាលពីមុនពេលដែលនាងមិនទាន់បានចូលរួមជាអ្នកស្ម័គ្រចិត្តមិត្តអប់រំមិត្ត របស់សមាគ យុវជនខ្មែរ&nbsp;(KYA)&nbsp;មិនដែលបានបណ្តុះបណ្តាលពីបញ្ហាសុខភាពបន្តពូជ និងសុខភាពផ្លូវភេទមក នាងខ្ញុំក៏ដូចជាមិត្តយុវវ័យដទៃទៀតផងដែរតែងមានការខ្មាសអៀន ហើយក៏មិនបានដឹងថាខ្លួនឯងមានលក្ខណៈនៃរាងកាយ ឫការប្រែប្រួលយ៉ាងដូចម្តេចដែរ ណាមួយពុំដែលបានចាប់អារម្មណ៍ចំពោះបញ្ហាសុខភាពផ្លូវភេទនេះទេពីមុនមក ហើយធ្លាប&nbsp;យល់ថាវាគ្មានសារសំខាន់អ្វីទេ បើចង់ដឹងគ្រាន់តែសួរម៉ែ យាយ ឫស្រី្តចាស់ៗដោយសំងាត់ទៅដឹងហើយ ម្យ៉ាងវិញទៀតគឺគេប្រកាន់ណាស់ថាក្មេងស្រីណានិយាយរឿងសុខភាពផ្លូវភេទអ៊ីចឹងសុទ្ធតែរឿងចំអេះចំអាស និងគេគិតថាជាមនុស្សស្រីមិនល្អផងដែរ&nbsp;(ធ្លាប់ឆ្លងកាត់ការរួមភេទ ជាដើម)&nbsp;។&nbsp;ក្រោយពីបានចូលរួមក្នុងការបណ្តុះបណ្តាលជាមួយសមាគមយុវជនខ្មែរ និងត្រូវបានជ្រើសរើសឲ្យនាងខ្ញុំធ្វើជាមិត្តអប់រំមិត្តរយៈពេលប្រហែល២ឆ្នាំងជាង ក្នុងភូមិអ៊ីន ឃុំអណ្តូងមាស មក នាងខ្ញុំបានខិតខំមើលមេរៀន និងឯកសារបន្ថែមស្តីពីសុខភាពបន្តពូជ ផ្លូវភេទ និងយុវវ័យ ជាពិសេសមេរៀននៃសុខភាពទាំង១២ដែលយើងមានក្នុងដៃសម្រាប់បង្រៀនដល់យុវវ័យបន្ត មុនដំបូងគឺមា ភាពលំបាកខ្លះៗដោយមានការរើសអើង និងមានភាពអៀនខ្មាសច្រើន តែក្រោយពេលដែលបានអប់រំផ្នែកសុខភាពក្នុងភូមិអ៊ីន មួយរយៈកាលនេះមក នាងខ្ញុំសង្កេតឃើញថា យុវវជនមានការកែប្រែ លែងសូវមានភាពខ្មាសអៀន ចេះសាកសួរពីបញ្ហាសុខភាពផ្សេងៗ និងរត់ទៅរកមណ្ឌលសុខភាពដើម្បីសេវាថែទាំផ្សេងៗ និងសម្រាលកូននៅមណ្ឌលជាដើម។&nbsp;នាងខ្ញុំនៅតែចង់បន្តការអប់រំយុវវ័យក្នុងភូមិរបស់នាងខ្ញុំដដែល ដើម្បីចង់ឃើញមានការផ្តាស់ប្តូរទម្លាប់ចាស់ៗ និងទទួលបានចំណេះដឹងថ្មី និងដើម្បីមានភាពរីកចម្រើនផងដែរ ជាពិសេសការយល់ដឹងផ្នែកសុខភាពតែម្តង។ ហើយនាងខ្ញុំចង់សួរថា តើសមាគមយុវជនខ្មែរ បន្តគម្រោងសុខភាពនេះប៉ុន្មានឆ្នាំទៀត?&nbsp;ដោយនាងខ្ញុំចង់ឲ្យសមាគមយុវវជនខ្មែរ នៅតែបន្តការជួយគាំទ្រដល់ការអប់រំផ្នែកសុខភាពនេះ និងជួយបង្រៀនដល់ក្រុមមិត្តអប់រំមិត្ត និងយុវវ័យឲ្យកាន់តែមានភាពក្លានហាន និងចំណេះដឹងថ្មីៗ ។</p>', 'post2.png', 1, '2018-05-09 09:10:57', 10),
(3, 'ចេះបង្កើតផែនការដើម្បីអនាគត', 'ប្អូនប្រុស សាន​​ វណ្ណារ៉ា ជាសិស្សថ្នាក់ទី៩A នៃវិទ្យាល័យឈីនលាន ហាន់ជ័យ ស្ថិតក្នុងឃុំហាន់ជ័យស្រុកកំពង់សៀម ខេត្តកំពង់ចាម់ មានចម្ងាយ៣០គីឡូម៉ែត ពីទីរួមខេត្តកំពង់ចាម់។ ជាមួយនឹងស្នាមញញឹមប្រកបដោយភាពជឿជាក់ប្អូនប្រុសវណ្ណារ៉ា គឺជាសិស្សម្នាក់', '<p>ប្អូនប្រុស សាន​​ វណ្ណារ៉ា ជាសិស្សថ្នាក់ទី៩A&nbsp;នៃវិទ្យាល័យឈីនលាន ហាន់ជ័យ ស្ថិតក្នុងឃុំហាន់ជ័យស្រុកកំពង់សៀម ខេត្តកំពង់ចាម់ មានចម្ងាយ៣០គីឡូម៉ែត ពីទីរួមខេត្តកំពង់ចាម់។ជាមួយនឹងស្នាមញញឹមប្រកបដោយភាពជឿជាក់ប្អូនប្រុសវណ្ណារ៉ា គឺជាសិស្សម្នាក់ដែលតស៊ូ ក៍ប៉ុន្តែគាត់ទទួលបានត្រឹមចំណាត់ថ្នាក់លេខ ១៥ទៅ១៨ប៉ុណ្ណោះ។ ដោយសមាគមយុវជនខ្មែរតាំងខែមេសា ឆ្នាំ២០១៧មកវណ្ណារ៉ា បានក្លាយជាប្រធានក្លឹបសិក្សា(ក្លឹបក្តីស្រមៃ)ហើយគាត់ខិតខំចូលរួមគ្រប់សកម្មភាព របស់គម្រោង រហូតមានការផ្លាស់ប្តូរឥរិយាបទ នឹងទម្លាប់ជាច្រើនដើម្បីអភិវឌ្ឍន៍ខ្លួនឯង និងសាលារៀនផងដែរ។បន្ទាប់ពីរការប្រជុំនិងការចែករំលែកចំណេះដឹង ដែលផ្តួចផ្តើមពីសមាគមយុវជនខ្មែរសព្វថ្ងៃវណ្ណារ៉ាទទួលបានចំណាត់ថ្នាក់លេខ៨ទៅ៩ជាប្រចាំដែលកាលពីមុនវណ្ណារ៉ាទទួលបានចំណាត់ថ្នាក់លេខ១៥ទៅ៨ប៉ុណ្ណោះ។ វណ្ណារ៉ាមានភាពក្លាហ៊ានជាងមុន ហ៊ានឡើងនិយាយក្នុងចំណោមមនុស្សជាច្រើន បែងចែកប្លង់សំអាតទីធ្លាសាលាជាប្រចាំ មានផែនការអនាគតច្បាស់លាស់។ដោយមើលឃើញភាពក្លាហាន និងភាពជាគម្រូរបស់ វណ្ណារ៉ាមិត្តិភក្ដិរួមថ្នាក់បានអញ្ជើញ ឲ្យជួយពន្យល់មេរៀននៅពេលទំនេរពីការសិក្សារនិងចង់ចូលរួមជាមួយកម្មភាពផ្សេងៗរបស់គាត់។&nbsp;អាណាព្យាបាល វណ្ណារ៉ា រីករាយណាស់ ដែលទទួលបានអាហារូបករណ៍គាត់ជម្រុញឲ្យវណ្ណារ៉ាមករៀនទៀងទាត់ជាងមុន។ វណ្ណារ៉ា ជាក្មេងដែលកំព្រាម្តាយតែទោះជាយ៉ាងណាក៍ដោយវណ្ណារ៉ានៅតែខិតខំប្រឹងប្រែងរៀនសូត្រហើយវណ្ណារ៉ាបានសម្រាចចិត្តថាគាត់និងចាប់អាជីពជាគ្រូបង្រៀ​នគាត់<u>បានប្រាប់វពីមូលហេតុ</u>ផ្សេងៗទៅអាណាព្យាបាលរបស់គាត់ហើយគាត់បានយល់ស្របតាមវណ្ណារ៉ា ថែមទាំងឲ្យវណ្ណារ៉ារៀ​នសូត្រមិនអោយ ធ្វើការងាអ្វីក្រៅពីរៀនឡើយ។&nbsp;លោកគ្រូភា គិននាយកវិទ្យាល័យ ឈីនលានហានជ័យ មានប្រសាសន៍ថា បន្ទាប់ពីសាលាទទួលបានអាហារូបករណ៍ របស់គម្រោងមកសិស្សមានភាពក្លាភាពជាអ្នកដឹកនាំ ជាពិសេសគម្រោងបានមកនូវសកម្មភាពប្លែកៗសម្រាប់សាលា ជាពិសេសSTEM BUS&nbsp;វេទទិការស្ដីពីការងារ យុទ្ធនាការក្នុងសាលា&nbsp;អាហារូបករណ៍លើកកម្ពស់ភាពជាអ្នកដឹកនាំ។ល៕</p>', 'post3.jpg', 1, '2018-05-09 09:11:59', 10),
(4, 'ការតស៊ូរបស់ក្មេងស្រីម្នាក់ទទួលបានជោគជ័យ តស៊ូខ្ពស់ ដើម្បី ការសិក្សារបស់នាងទទួលបាន ជោគជ័យដោយការ ខិតខំប្រឹងប្រែងទាំងការរៀន', 'ជាមួយភាពជឿជាក់នឹងស្នាមញញឹមដ៏អង់អាចក្លាហាន ដែរធ្វើឲ្យ កញ្ញា ណាង អេង បន្តការសិក្សាជាមួយគោលជំហរដ៏រឹងមាំរបស់ក្មេងស្រីជនបទម្នាក់ដែរមានជីវភាពក្រីក្រ តស៊ូរៀនដោយគ្មានឪពុកម្តាយជាកូនកំព្រារស់នៅជាមួយជីដូចាស់ម្នាក់ដែរមានជំងឺប្រចាំកាយ', '<p>ជាមួយភាពជឿជាក់នឹងស្នាមញញឹមដ៏អង់អាចក្លាហាន ដែរធ្វើឲ្យ កញ្ញា ណាង អេង បន្តការសិក្សាជាមួយគោលជំហរដ៏រឹងមាំរបស់ក្មេងស្រីជនបទម្នាក់ដែរមានជីវភាពក្រីក្រ តស៊ូរៀនដោយគ្មានឪពុកម្តាយជាកូនកំព្រារស់នៅជាមួយជីដូចាស់ម្នាក់ដែរមានជំងឺប្រចាំកាយ ការតស៊ូរៀន របស់ក្មេងស្រីម្នាក់នេះមានការលំបាកខ្លាំង ពីរមុននាងតែងតែទៅរៀនដោយដើរស្មើរជើងពីរផ្ទះទៅសាលាមានចំងាយ៣គីឡូម៉ែត។មានពេលខ្លះនាងបានជិះកងជាមួយមិត្តភត្រ័ពេលខ្លះក៏ដើរទៅសាលាដោយមានការលំបាកខ្លាំងពេកនាងមានបំណងឈប់រៀន។ប៉ុន្តែលោកគ្រូនាយករងសាលាវិទ្យាល័យជាចបាននែនាំអោយនាងចូលជាសិស្សអាហារូបករណ៏ក្នុងគម្រោងលើកកម្ពស់អនាគតសិស្សស្រីតាមរយៈការអប់រំ&ldquo;IAGED&rdquo;​&nbsp;នៅក្នុងសមាគមយុវជនខ្មែរសាខាខេត្តព្រៃវែង។&nbsp;ក្រោយពីនាងបានចូលជាសិស្សអាហារូបករណ៍ នាងបានបន្តការសិក្សារហូត ដល់ថ្នាក់ទី ១២&nbsp;កញ្ញាគឺជាសិស្សម្នាក់ដែរទទួលបានការកោតសរសើរពីមិត្តភក្រ័និងលោកគ្រូអ្នកគ្រូរបស់នាងដែរក្លាយជាសិស្សរៀនពូកែ ទាំងផ្នែកភាសាបរទេស និង ភាសាខ្មែរ នាងទទួលបានចំណាត់​ថ្នាក់ លេខតិចជាងមុន រហូត ជារាងរាល់ខែ។</p>\r\n\r\n<p>កញ្ញាបាននិយាយថា&divide;កាលពីមុខមិនទាន់ ចូលជាសិស្សអាហារូបករណ៏ នាង ជាមនុស្សខ្មាស់អៀនច្រើនមិនហ៊ាននិយាយចំពោះមនុស្សទូទៅជាច្រើនគ្មានភាពក្លាហ៊ានខ្លាចគេរៀនមិនសូវ ពូកែ ជាប់លេខ​ច្រើន ក្បែរ នាយក ស៊ីញ៉េរហូតនិងមានបំណងចង់បោះបង់ការសិក្សាគិតថាខ្លួនឯងរៀនមិនពូកែ ហើយម៉្យាងទៀតដោយ​សា​​រជីវភាពគ្រួសារ ក្រីក្រពេកឪពុកម្តាយលែងលៈគ្នា ហើយសព្វថ្ងៃនាងរស់នៅជាមួយ ជីដូនចាស់មានជំងឺគ្មានអ្នកមើលថែរនាងចង់ជួយសម្រួល​​ ជីវភាពគ្រួសារ។ ដោយបានការពិន្យល់នែនាំពីរលោកគ្រូនាយកសាលាហើយអោយនាងបានចូលជាសិស្សអាហារូបករណ៏ មក នាងបានតស៊ូបន្តការសិក្សាទៅមុខទាំងក្តីជឿរជាក់ហើយគម្រោងបានបើកកង់សម្ភារៈសិក្សានិងអង្ករបានជួយសម្រួលជីវភាពបានមួយកម្រិតផងដែរនិងជាពិសេសអោយនាងរៀនគួអត់គិតថ្លៃនាងសប្បាយចិត្តណាស់ដែលមានអង្គការជួយដល់នាងដោយឃើញឪកាសនេះហើយទើបនាងប្រឹងប្រែងរៀនអោយបានពូកែ។</p>\r\n\r\n<p>ចាប់តាំងពីនាងទទួលបានអាហារូបករណ៏ក្នុងខែមេសា ឆ្នាំ២០១៧ មក ណាង អេង បានក្លាយជា សិស្សពូកែអាចដឹកនាំគេរៀនជាប្រធានក្លិបសិក្សា ហើយកញ្ញាខិតខំចូលរួមគ្រប់សកម្មភាពរបស់គម្រោង រហូតមានការផ្លាស់ប្ដូរឥរិយាបទជាច្រើនហ៊ានឡើងនិយាយចំពោះមនុស្សច្រើនអាចឡើងកាន់កម្មវិធីក្នុងសកម្មភាពធំៗរបស់គម្រោង និងផ្លាស់ប្តូរទម្លាប់ជាច្រើន​ដើម្បីអភិវឌ្ឍន៍ខ្លួងឯង និងសាលារៀនផងដែរ។នាងចេះជួយមិត្តភក្រ័ដែរទន់ខ្សោយ​​ឲ្យល្អប្រ​សើរដូចនាង ចែករំលែកចំណេះដឹងនិងភាពក្លា​ហា​​​ន​​បទពិសោធន៏ផ្សេងៗទៀតដែលនាងមាននិងជួយបង្រៀនទៅដល់មិត្តភត្រ័ដែរមិនចេះ។ល។</p>', 'post4.jpg', 1, '2018-05-09 09:18:10', 12),
(5, 'លាហើយការសិក្សាដើម្បីជីវភាពគ្រួសារខ្ញុំ', 'កញ្ញា ណយ ស្រីស្រស់ គឺជាសិស្សម្នាក់ដែរខិតខំរៀនសូត្រចាប់តាំងពីនាងនៅក្មេងមកម្លេះហើយការរៀនសូត្ររបស់នាងក៏មានចំណាត់ថ្នាក់ល្អជាមធ្យមផងដែរ។តែដោយសារកត្តាជីវភាពគ្រួសាររបស់នាងក្រីក្រពេកនាងមានបំណងចង់បោះបង់ការសិក្សាជាច្រើនដង។​', '<p>កញ្ញា ណយ ស្រីស្រស់ ជាសិស្សថ្នាក់ទី១0 C&nbsp;នៃ វិទ្យាល័យ ព្រះបាទនរោត្តម ស្ថិតក្នុងឃុំកញ្ច្រៀច ស្រុកកញ្រ្ជៀច ខេត្តព្រៃវែង មានចម្ងាយ ៦៥គីឡូម៉ែត្រ ពីទីរួមខេត្តព្រៃវែង ។</p>\r\n\r\n<p>កញ្ញា ណយ ស្រីស្រស់ គឺជាសិស្សម្នាក់ដែរខិតខំរៀនសូត្រចាប់តាំងពីនាងនៅក្មេងមកម្លេះហើយការរៀនសូត្ររបស់នាងក៏មានចំណាត់ថ្នាក់ល្អជាមធ្យមផងដែរ។តែដោយសារកត្តាជីវភាពគ្រួសាររបស់នាងក្រីក្រពេកនាងមានបំណងចង់បោះបង់ការសិក្សាជាច្រើនដង។​ បន្ទាប់ពីនាង ទទួលបានអាហារូបករណ៍​ពី​សមាគ​មយុវជនខ្មែរ ក្នុងគម្រោង(លើកកម្ពស់អនាគត​សិស្សស្រីតាមរយៈការអប់រំ) &ldquo;IAGED&rdquo;&nbsp;មកនាងសម្រេចចិត្តតស៊ូរៀនបន្ត រហូតបានចប់ថ្នាក់១០ ហើយនាងបានសម្រេចចិត្តថាត្រូវតែបោះបង់ការសិក្សាចោលទាំងដែលខ្លួនមិនពេញចិត្ត តំរូវតាមជីវភាពគ្រួសាររបស់នាង។</p>\r\n\r\n<p>នាងបានបញ្ជាក់ប្រាប់ថា៖នាងសោកស្តាយខ្លាំងណាស់ដោយបានការជួយឧបត្ថមគាំទ្រពីអង្គការហើយនៅតែមិនបានរៀនបន្តទៀតពីព្រោះតែគ្រួសារខ្ញុំក្រីក្រឪពុកម្តាយបានលែងលះគ្នាបន្សល់នៅកូនកំព្រាបីនាក់នាងខ្ញុំជាកូនស្រីច្បងគេជួយមើលថែទាំប្អូនប្រុសស្រីពីនាក់ទៀត ដោយការលំបាកពេក ម្តាយខ្ញុំក៏ទៅធ្វើការនៅប្រទេសថៃបាត់ទៅនាងខ្ញុំរស់នៅជាមួយអ៊ុំស្រីចាស់ ហើយមានជំងឺដោយសារគ្រោះថ្នាក់ចរាចណ៏ប៉ុន្មានខែមុននឹងធ្វើឲខ្ញុំពិបាកក្នុងការរៀនសូត្របន្តក៏សម្រេចចិត្តបោះ​បង់​​ការសិក្សា ទៅធ្វើការរោងចក្រកាត់ដេរនៅភ្នំពេញជា​មួយបងស្រីជាអ្នកជិតខាង។</p>', 'post5.png', 1, '2018-05-09 09:19:56', 10),
(6, 'ចាប់ផ្តើមអនាគត់ថ្មីជាមួយក្តីសង្ឃឹម sdf skdfj', 'ជាមួយភាពជឿជាក់នឹងស្នាមញញឹមដ៏អង់អាចក្លាហាន ដែរធ្វើឲ កញ្ញា អេង ធិត គឺជាសិស្សម្នាក់ដែរទទួលបានការកោតសរសើរពីមិត្តភក្រ័និងគ្រួសាររបស់នាងក្រោយពីបានចូលជាសិស្ស អាហារូបករណ៍​ពី​សមាគមយុវជនខ្មែរ គម្រោងលើកកម្ពស់អនាគត​សិស្សស្រីតាមរយៈការអប់រំ', '<p>កញ្ញា អេង ធិត ជាសិស្សថ្នាក់ទី១១B&nbsp;នៃ វិទ្យាល័យ ជាច ស្ថិតក្នុងឃុំជាច ស្រុកកំចាយមារ ខេត្តព្រៃវែង មានចម្ងាយ ៦0&nbsp;គីឡូម៉ែត្រ ពីទីរួមខេត្តព្រៃវែង ។</p>\r\n\r\n<p>ជាមួយភាពជឿជាក់នឹងស្នាមញញឹមដ៏អង់អាចក្លាហាន ដែរធ្វើឲ កញ្ញា អេង ធិត គឺជាសិស្សម្នាក់ដែរទទួលបានការកោតសរសើរពីមិត្តភក្រ័និងគ្រួសាររបស់នាងក្រោយពីបានចូលជាសិស្ស អាហារូបករណ៍​ពី​សមាគមយុវជនខ្មែរ គម្រោងលើកកម្ពស់អនាគត​សិស្សស្រីតាមរយៈការអប់រំ &ldquo;IAGED&rdquo;មកនាងក្លាយជាសិស្សរៀនពូកែ ទាំងផ្នែកភាសាបរទេស និង ខ្មែរនាងទទួលបានចំណាត់​ថ្នាក់លេខ១ ជារាងរាល់ខែ ។ កាលពីមុខមិនទាន់ ចូលជាសិស្សអាហារូបករណ៏ អេង ធិតជាមនុស្សខ្មាស់អៀនច្រើនមិនហ៊ាននិយាយចំពោះមនុស្សច្រើននិងមានបំណងចង់បោះបង់ការសិក្សាដោយសារជីវភាពគ្រួសារ ក្រីក្រពេកហើយ ម្តាយចាស់មានជំងឺនាងចង់ជួយសំរាល់ជីវភាពគ្រួសារ ដោយបានការពិន្យល់នែនាំពីរលោកគ្រូអ្នកគ្រូនាងបន្តការសិក្សាទាំងមិនពេញចិត្ត។&nbsp;ចាប់តាំងពីនាងទទួលបានអាហារូបករណ៏ក្នុងខែមេសា ឆ្នាំ២០១៧ មក អេង ធិត បានក្លាយជាប្រធានក្លឹបសិក្សា&nbsp;TGS(Team good student)ហើយកញ្ញាខិតខំចូលរួមគ្រប់សកម្មភាព របស់គម្រោង រហូតមានការផ្លាស់ប្ដូរឥរិយាបទ និងទម្លាប់ជាច្រើន​ដើម្បីអភិវឌ្ឍន៍ខ្លួងឯង និងសាលារៀនផងដែរ។នាងចេះជួយមិត្តភក្រ័ដែរទន់ខ្សោយឲល្អប្រ​សើរដូចនាង ចែករំលែកចំណេះដឹងនិងភាពក្លា​ហា​​​ន​​បទពិសោធន៏ផ្សេងៗទៀតដែលនាងមាន។</p>\r\n\r\n<p>បន្ទាប់ពីដំណើរទស្សនៈកិច្ចសិក្សា ការប្រជុំក្លឹប​ប្រចាំ​សប្តាហ៏ នាងទទួលបានលទ្ធផលល្អប្រសើរឡើងជារាងរាល់ថ្ងៃក្លាយជាមនុស្សចេះស្រលាញ់ការសិក្សាក្លាហានហ៊ានសួរហ៊ាននិយាយក្នុង&nbsp;ចំណោម​មនុស្សជាច្រើននិងបង្កើតគំនិតថ្មីៗជួយដល់សង្គមនិងគ្រួសារ។ នាងដឹកនាំសិស្សមួយចំនួនបែងចែកប្លង់សំអាតទីធា្លសាលាជាប្រចាំ&nbsp;មានផែនការអនាគតច្បាស់លាស់។&nbsp;ដោយមើលឃើញភាពអង្គអាចក្លាហាន នឹងភាពជាគម្រូ​របស់នាង មិត្តភ័ក្ដិរួមសាលា​បានកោតសរសើរការ ផ្លាស់ប្តូរឥរិយាបទ និងកាខិតខំប្រឹងប្រែងរៀនសូក្រ ធ្វើឲ្យ មិត្តភក្រ័ រួមថ្នាក់ ​អញ្ជើញ នាង អោយជួយពន្យល់មេរៀននិងរៀនតាមទង្វើរបស់នាង នៅពេលទំនេរពីការសិក្សា និងចង់ចូលរួមជាមួយសកម្មភាពរបស់​កញ្ញាផងដែរ ។&nbsp;អាណាព្យាបាលរបស់ អេង ធិត រីករាយ​ដែលបានឃើញកូនស្រីខិតខំប្រឺងប្រែងរៀនសូត្រនិងជួយដល់សង្គមក៏ដូចមិត្តរបស់នាងគាត់រំភើបជាខ្លាំងដោយឃើញកូនស្រីមានគោលដៅច្បាស់លាស់ពេលអនាគត់។&nbsp;លោកគ្រូ សឿន សេង នាយករងវិទ្យាល័យ​​​​​ជាចមានប្រសាសន៍ថាបន្ទាប់ពី​​​សាលាទទួលបានអាហារូបករណ៍មកលោកមានចិត្តសប្បាយរីករាយមែនទែនដោយ&nbsp;ឃើញសិស្សដែរទទួលបានអាហារូបករណ៏ទាំងអស់របស់គម្រោង(លើកកម្ពស់អនាគត់សិស្សស្រីតាមរយៈការអប់រំ)មានការផ្លាស់ប្តូរ​​ឥរិយាបទចេះស្រលាញ់និងជួយគ្នាទៅវិញទៅមកមានភាពក្លាហានចូលរួមគ្រប់សកម្មភាពក្នុងសាលាបានជាច្រើនហើយធ្វើអ្វីដោយមានភាពជាម្ចាស់ការមានភាពជាអ្នកដឹកនាំ ជាពិសេសចេះកែប្រែសោភ័ណ្ឌភាពក្នុងបណ្ណាល័យទីធ្លាសាលាបានយ៉ាងស្អាតហើយគម្រោង​បាននាំមកនូវសកម្មភាពប្លែកៗ សម្រាប់​សាលា ជាពិសេស វេទិកាស្ដីពីការងារ យុទ្ធនាការក្នុងសាលា អាហារូបករណ៍លើកកម្ពស់ភាពជាអ្នកដឹកនាំ។ល។</p>', 'post6.jpg', 1, '2018-05-09 09:21:09', 10),
(7, 'យុវជនស្មាក់ចិត្តជួយដល់ប្រជាតស៊ូខ្ពស់ ដើម្បី ការសិក្សារបស់នាងទទួលបាន ជោគជ័យដោយការ ខិតខំប្រឹងប្រែងទាំងការរៀន', 'ជាមួយ ស្នាមញញឹម ប្រកបដោយភាពជឿជាក់សារ​​ជាថ្មី របស់ បេទ សីហា គឺជាសិស្សម្នាក់ដែរមានការ​ តស៊ូខ្ពស់ ដើម្បី ការសិក្សារបស់ខ្លួនតាំងពីរតូចនិង​ប្រកបដោយ​ភាពក្លា​ហាន​ហ៊ានចូលរួមគ្រប់សកម្មភាពរបស់', '<p><strong>ប្អូនប្រុស បេទ សីហា ជាសិស្សថ្នាក់ទី១២&nbsp;B&nbsp;នៃ វិទ្យាល័យ អង្គរសរ ស្ថិតក្នុងឃុំអង្គរសរ ស្រុកមេសាង ខេត្តព្រៃវែង មានចម្ងាយ ៦០គីឡូម៉ែត្រ ពីទីរួមខេត្តព្រៃវែង ។</strong></p>\r\n\r\n<p>ជាមួយ ស្នាមញញឹម ប្រកបដោយភាពជឿជាក់សារ​​ជាថ្មី របស់ បេទ សីហា គឺជាសិស្សម្នាក់ដែរមានការ​ តស៊ូខ្ពស់ ដើម្បី ការសិក្សារបស់ខ្លួនតាំងពីរតូចនិងប្រកបដោយភាពក្លាហានហ៊ានចូលរួមគ្រប់សកម្មភាពរបស់អង្គការសីហាគឺជាក្មេងប្រុសម្នាក់ទទួលបាន ជោគជ័យដោយការ ខិតខំប្រឹងប្រែងទាំងការរៀនសូត្រនិងឆ្លៀតរកការងារក្រៅម៉ោងដើម្បីយកកំរៃមករៀនបន្ត​ ជាពិសេសសីហា ចូលរួមស្មាក់ចិត្តជាមួយសមាគមយុវជនខ្មែរដើម្បីយកបទពិសោធន៏និងចំណេះដឹងទៅចែករំលែកពត៌មានសំខាន់ៗទៅដល់ប្រជាពលរដ្ឋក្នុងសហគមន៏ សីហា មានការប្តេផ្ញាខ្ពស់ក្នុងការរៀនសូត្រជាមួយសមាគមយុវជនខ្មែរដើម្បីទទួលបានចំនេះដឹងទៅចែករំលែកដល់ប្រជាជនក្នុងសហគមន៏របស់ខ្លួន សីហាមានការកោតសរសើរពីមិត្តភក្រ័ជាច្រើនក្រោយពីបានចូលជាសិស្ស ឆ្នើមនិងជាបណ្តាញរបស់ សមាគមយុវជនខ្មែរ គម្រោងទេសន្តប្រវេសដ៏ឆ្លាតវៃនិងប្រឆាំងអំពើជួញដូរមនុស្ស។សីហា ជាបណ្តាញយុវជនស្មាក់ចិត្តប្រចាំឃុំ អង្គសរ គាត់ ស្មាក់ចិត្តផង រៀន ផង រកចំណូលជួយគ្រួសារផង ។ ពេលសីហាចូលជា&nbsp;បណ្តាញរបស់សមាគមយុវជនខ្មែរ បានចូលរួមជួយគ្រប់សកម្មភាពទាំងអស់ដូចជាៈការជួយសម្របសម្រួលយុទ្ធនាការអប់រំផ្សព្វផ្សាយតាមសាលាការផ្សព្វផ្សាយដល់មិត្តភត្រ័អំពីរការធ្វើចំណាកស្រុកដ៏ឆ្លាតវៃចូលរួមផ្សព្វផ្សាយចន្ល័តក្នុងសហគមន៏ប្រជុំជាមួយអជ្ញាធរមូលដ្ឋាននិងជាមួយប្រជាពលរដ្ឋក្នុងសហគមន៏របស់ខ្លួនផងដែរ។ដោយឃើញថានៅក្នុងភូមិរបស់សីហាមានការចាញ់បោកគេជាច្រើនតាមរយៈការមិនដឹងពីរពត៌មានច្បាស់លាស់ការចាក់ចេញពីស្រុកដោយប្រថុយប្រថាន​​ សីហាឃើញដូច្នោះក៏មានចិត្តចង់ជួយដល់ប្រជាពលរដ្ឋនៅសហគមន៏។នៅពេលដែរសមាគមយុវជនខ្មែរជ្រើរើសអ្នកស្មាក់ចិត្តធ្វើជាបណ្តាញសហគមន៏ សីហាក៏បានស្មាក់ចិត្តមុខគេ ហើយប្រលងជាប់ទៅរៀនវគ្គបណ្តុះបណ្តាលនៅភ្នំពេ​ញ។ពេលសីហាត្រឡប់មកវិញបានផ្សព្វផ្សាយនិងចែករំលែកពត៌មាន ដែរខ្លួនបានដឹងនិងរៀនសូត្រពីរសមាគមយុវជនខ្មែទៅចែករំលែកដល់មិត្តភត្រ័ក៏ដូចជាប្រជាពលរដ្ឋអោយបានដឹងនិងចេះការពារខ្លួនពីការចាញ់បោកគេនិងបានបញ្ជាក់លេខទូរសព្ទ័តាមរយៈសៀវភៅចំណាកស្រុកដ៏ឆ្លាតវៃរបស់គម្រោង ទេសន្តប្រវេសដ៏ឆ្លាតវៃនិងប្រឆាំងអំពើជួញដូរមនុស្ស។ចាប់តាំងពីសីហាបានស្មាក់ចិត្តជួយផ្សព្វផ្សាយពត៌មានទៅដល់ប្រជាពលរដ្ឋបានមួយចំនួនធំយល់ដឹងចេះការពារខ្លួនពីការចាញ់បោកគេ។សម្រាបប្រជាពលរដ្ឋបានកោតសរសើរសីហាមិនដាច់ពីមាត់ថា ក្មេងឆ្លាតនិងពូកែមិត្តភត្រសីហាឃើញដូច្នេះក៏មានចិត្តចង់ចូលរួមស្មាក់ចិត្តនៅសមាគមយុវជនខ្មែរជាច្រើនអ្នកផងដែរ។សីហានៅតែបន្តស្មាក់ចិត្តនិងចែករំលែកចំណេះដឹកទៅអ្នកដទៃរហូតបើមានបញ្ហា។មកដល់ឥឡូវនេះសីហានៅតែបន្តស្មាក់ចិត្តជាមួយអង្គការដទៃដើម្បីទទួលបានបទពិសោធន៏ថ្មីៗ សីហាបានចូលជាប្រធានក្រុមយុវជនប្រចាំឃុំអង្គរសររបស់អង្គការ&nbsp;Word Vision&nbsp;គាត់បានចែករំលែកពត៌មានជាក់ស្តែងពីការធ្វើចំណាកស្រុកដោយប្រថុយប្រថាននិងលើយកសៀវភៅរួមគ្នាការពារខ្លួន​ និងសហគមន៏យើងឲ្យផុតពីអំពើជួញដូរមនុស្ស របស់សមាគមយុវជនខ្មែរទៅចែករំលែកនៅក្នុងកម្មវិធី ការធ្វើចំណាកស្រុកដោយអសុវត្ថិភាព និងការប្រើអំពើ​​&nbsp;ហឹង្សាក្នុងគ្រួសាររបស់គម្រោង អង្គការ​&nbsp;Word Vision&nbsp;ប្រជាពលរដ្ឋចំនួន៣០០នាក់ទទួលបានពត៌មានយ៉ាងជាក់លាក់ពីសីហា។&nbsp;មិត្តភត្ររបស់សីហាបាននិយាយថាការចូលជាបណ្តាញរបស់សមាគមយុវជនខ្មែរគឺតំរូវឲ្យយើងមានភាពក្លាហាននិងទទួលបានចំណេះដឹងជាច្រើននិងកោតសរសើរដល់សីហាមាន ការ ផ្លាស់ប្តូរឥរិយាបទ និងកាខិតខំប្រឹងប្រែងរៀនសូក្រ ធ្វើឲ្យមិត្តភក្រ័ រួមថ្នាក់ ក៏ដូចរួមសាលាច្រណែននិងសរសើរសីហាជាខ្លាំង។</p>', 'post7.jpg', 1, '2018-05-09 09:21:55', 10),
(8, 'តស៊ូក្នងការសិក្សាដើម្បីមអនាគត់ខ្ញុំតស៊ូខ្ពស់ ដើម្បី ការសិក្សារបស់នាងទទួលបាន ជោគជ័យដោយការ', 'ជាមួយ ស្នាមញញឹម ប្រកបដោយភាពជឿជាក់សារ​​ជាថ្មី របស់ កញ្ញា រ៉ូយ ស៊ានលីន គឺជាសិស្សម្នាក់ដែរមានការ​ តស៊ូខ្ពស់ ដើម្បី ការសិក្សារបស់នាងទទួលបាន ជោគជ័យដោយការ ខិតខំប្រឹងប្រែងទាំងការរៀន', '<p><strong>កញ្ញា រ៉ូយ ស៊ានលីន ជាសិស្សថ្នាក់ទី១១&nbsp;B&nbsp;នៃ វិទ្យាល័យ ព្រះបាទនរោត្តម ស្ថិតក្នុងឃុំកញ្ជៀច ស្រុកកញ្ជ្រៀច ខេត្តព្រៃវែង មានចម្ងាយ ៦៥គីឡូម៉ែត្រ ពីទីរួមខេត្តព្រៃវែង ។</strong></p>\r\n\r\n<p>ជាមួយ ស្នាមញញឹម ប្រកបដោយភាពជឿជាក់សារ​​ជាថ្មី របស់ កញ្ញា រ៉ូយ ស៊ានលីន គឺជាសិស្សម្នាក់ដែរមានការ​ តស៊ូខ្ពស់ ដើម្បី ការសិក្សារបស់នាងទទួលបាន ជោគជ័យដោយការ ខិតខំប្រឹងប្រែងទាំងការរៀនសូត្រនិងឆ្លៀតរកការងារក្រៅម៉ោងដើម្បីយកកំរៃមករៀនបន្ត​ ការកោតសរសើរពីមិត្តភក្រ័និងគ្រួសាររបស់នាងក្រោយពីបានចូលជាសិស្ស អាហារូបករណ៍​ពី​សមាគមយុវជនខ្មែរ គម្រោងលើកកម្ពស់អនាគត​សិស្សស្រីតាមរយៈការអប់រំ &ldquo;IAGED&rdquo;មកនាងក្លាយជាសិស្សរៀនពូកែ ទាំងផ្នែកភាសាបរទេស និង ខ្មែរនាងទទួលបានចំណាត់​ថ្នាក់លេខ១ ជារាងរាល់ខែ ។ កាលពីមុខមិនទាន់ ចូលជាសិស្សអាហារូបករណ៏ អេង ធិតជាមនុស្សខ្មាស់អៀនច្រើនមិនហ៊ាននិយាយចំពោះមនុស្សច្រើននិងមានបំណងចង់បោះបង់ការសិក្សាដោយសារជីវភាពគ្រួសារ ក្រីក្រពេកហើយ ម្តាយចាស់មានជំងឺនាងចង់ជួយសំរាល់ជីវភាពគ្រួសារ ដោយបានការពិន្យល់នែនាំពីរលោកគ្រូអ្នកគ្រូនាងបន្តការសិក្សាទាំងមិនពេញចិត្ត។</p>\r\n\r\n<p>ចាប់តាំងពីនាងទទួលបានអាហារូបករណ៏ក្នុងខែមេសា ឆ្នាំ២០១៧មក អេង ធិត បានក្លាយជាប្រធានក្លឹបសិក្សា&nbsp;TGS(Team good student)ហើយកញ្ញាខិតខំចូលរួមគ្រប់សកម្មភាព របស់គម្រោង រហូតមានការផ្លាស់ប្ដូរឥរិយាបទ និងទម្លាប់ជាច្រើន​ដើម្បីអភិវឌ្ឍន៍ខ្លួងឯង និងសាលារៀនផងដែរ។នាងចេះជួយមិត្តភក្រ័ដែរទន់ខ្សោយឲល្អប្រ​សើរដូចនាង ចែករំលែកចំណេះដឹងនិងភាពក្លា​ហា​​​ន​​បទពិសោធន៏ផ្សេងៗទៀតដែលនាងមាន&nbsp;បន្ទាប់ពីដំណើរទស្សនៈកិច្ចសិក្សា ការប្រជុំក្លឹប​ប្រចាំ​សប្តាហ៏ នាងទទួលបានលទ្ធផលល្អប្រសើរឡើងជារាងរាល់ថ្ងៃក្លាយជាមនុស្សចេះស្រលាញ់ការសិក្សាក្លាហានហ៊ានសួរហ៊ាននិយាយក្នុង&nbsp;ចំណោម​មនុស្សជាច្រើននិងបង្កើតគំនិតថ្មីៗជួយដល់សង្គមនិងគ្រួសារ។ នាងដឹកនាំសិស្សមួយចំនួនបែងចែកប្លង់សំអាតទីធា្លសាលាជាប្រចាំ&nbsp;មានផែនការអនាគតច្បាស់លាស់។&nbsp;ដោយមើលឃើញភាពអង្គអាចក្លាហាន នឹងភាពជាគម្រូ​របស់នាង មិត្តភ័ក្ដិរួមសាលា​បានកោតសរសើរការ ផ្លាស់ប្តូរឥរិយាបទ និងកាខិតខំប្រឹងប្រែងរៀនសូក្រ ធ្វើឲមិត្តភក្រ័ រួមថ្នាក់ ​អញ្ជើញ នាង អោយជួយពន្យល់មេរៀននិងរៀនតាមទង្វើរបស់នាង នៅពេលទំនេរពីការសិក្សា និងចង់ចូលរួមជាមួយសកម្មភាពរបស់​កញ្ញាផងដែរ ។&nbsp;អាណាព្យាបាលរបស់ អេង ធិត រីករាយ​ដែលបានឃើញកូនស្រីខិតខំប្រឺងប្រែងរៀនសូត្រនិងជួយដល់សង្គមក៏ដូចមិត្តរបស់នាងគាត់រំភើបជាខ្លាំងដោយឃើញកូនស្រីមានគោលដៅច្បាស់លាស់ពេលអនាគត់។&nbsp;លោកគ្រូ សឿន សេង នាយករងវិទ្យាល័យ​​​​​ជាចមានប្រសាសន៍ថាបន្ទាប់ពី​​​សាលាទទួលបានអាហារូបករណ៍មកលោកមានចិត្តសប្បាយរីករាយមែនទែនដោយ&nbsp;ឃើញសិស្សដែរទទួលបានអាហារូបករណ៏ទាំងអស់របស់គម្រោង(លើកកម្ពស់អនាគត់សិស្សស្រីតាមរយៈការអប់រំ)មានការផ្លាស់ប្តូរ​​ឥរិយាបទចេះស្រលាញ់និងជួយគ្នាទៅវិញទៅមកមានភាពក្លាហានចូលរួមគ្រប់សកម្មភាពក្នុងសាលាបានជាច្រើនហើយធ្វើអ្វីដោយមានភាពជាម្ចាស់ការមានភាពជាអ្នកដឹកនាំ ជាពិសេសចេះកែប្រែសោភ័ណ្ឌ&nbsp;ភាពក្នុងបណ្ណាល័យទីធ្លាសាលាបានយ៉ាងស្អាត&nbsp;ហើយគម្រោង​បាននាំមកនូវសកម្មភាពប្លែកៗ សម្រាប់​សាលា ជាពិសេស វេទិកាស្ដីពីការងារ យុទ្ធនាការក្នុងសាលា អាហារូបករណ៍លើកកម្ពស់ភាពជាអ្នកដឹកនាំ។ល។</p>', 'post8.jpg', 1, '2018-05-09 09:22:50', 12),
(9, '18 FLOORS PROJECT', 'Lorem ipsum dolor sit amet', '<p>test</p>', 'post9.jpg', 1, '2018-05-09 16:33:19', 2),
(10, '10 FLOORS PROJECT', 'Lorem ipsum dolor sit amet', '<p>Lorem ipsum dolor sit amet</p>', 'post10.jpg', 1, '2018-05-09 16:46:21', 2),
(11, '3 FLOORS PROJECT', 'Lorem ipsum dolor sit amet', '<h5><a href=\"http://localhost:8000/#\"><strong>Lorem ipsum dolor sit amet</strong></a></h5>', 'post11.jpg', 1, '2018-05-09 16:47:00', 2),
(12, 'High Structured Bending Project', 'Lorem ipsum dolor sit amet', '<p>Lorem ipsum dolor sit amet</p>', 'post12.jpeg', 1, '2018-05-09 16:48:33', 2),
(13, '12 FLOORS PROJECT', 'Lorem ipsum dolor sit amet', '<p>test</p>', 'post13.jpg', 0, '2018-05-09 16:49:05', 2),
(14, 'test 5', 'test', '<p>test</p>', 'post14.jpg', 0, '2018-05-09 16:49:25', 2),
(15, 'Hello World', 'Test', '<p>Test</p>', 'post15.jpg', 0, '2018-05-27 13:04:14', NULL),
(16, 'Hello World', 'Hello World!', NULL, 'post16.jpg', 1, '2018-05-27 15:38:58', 10),
(17, 'Test posting in project category that has id 13', 'Test some short description', NULL, 'post17.jpg', 1, '2018-05-27 17:08:27', 13);

-- --------------------------------------------------------

--
-- Table structure for table `project_locations`
--

CREATE TABLE `project_locations` (
  `id` int(11) NOT NULL,
  `title` varchar(250) NOT NULL,
  `address` text NOT NULL,
  `icon` varchar(250) DEFAULT NULL,
  `active` tinyint(4) NOT NULL DEFAULT '1',
  `create_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `region_id` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `project_locations`
--

INSERT INTO `project_locations` (`id`, `title`, `address`, `icon`, `active`, `create_at`, `region_id`) VALUES
(1, 'Hello World!', 'RUPP, Phnom Penh', '1-buzz.png', 1, '2018-05-28 09:28:17', 2);

-- --------------------------------------------------------

--
-- Table structure for table `project_regions`
--

CREATE TABLE `project_regions` (
  `id` int(11) NOT NULL,
  `name` varchar(90) NOT NULL,
  `active` bit(1) NOT NULL DEFAULT b'1',
  `create_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `project_regions`
--

INSERT INTO `project_regions` (`id`, `name`, `active`, `create_at`) VALUES
(1, 'Kampot', b'1', '2018-06-15 08:07:05'),
(2, 'Phnom Penh', b'1', '2018-06-15 08:07:05'),
(3, 'Takeo', b'1', '2018-06-15 08:07:32'),
(4, 'Kep', b'1', '2018-06-15 08:07:32'),
(5, 'Kandal', b'1', '2018-06-15 09:43:30');

-- --------------------------------------------------------

--
-- Table structure for table `recent_news`
--

CREATE TABLE `recent_news` (
  `id` int(11) NOT NULL,
  `title` varchar(220) NOT NULL,
  `short_description` tinytext,
  `description` text,
  `featured_image` varchar(200) DEFAULT NULL,
  `active` tinyint(4) NOT NULL DEFAULT '1',
  `create_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `roles`
--

CREATE TABLE `roles` (
  `id` int(11) NOT NULL,
  `name` varchar(50) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Dumping data for table `roles`
--

INSERT INTO `roles` (`id`, `name`) VALUES
(1, 'Administrator'),
(4, 'អ្នកបញ្ចូលទិន្នន័យ'),
(5, 'Manager'),
(10, 'Viewer');

-- --------------------------------------------------------

--
-- Table structure for table `role_permissions`
--

CREATE TABLE `role_permissions` (
  `id` int(11) NOT NULL,
  `role_id` int(11) NOT NULL,
  `permission_id` int(11) NOT NULL,
  `list` int(11) NOT NULL DEFAULT '0',
  `insert` int(11) NOT NULL DEFAULT '0',
  `update` int(11) NOT NULL DEFAULT '0',
  `delete` int(11) NOT NULL DEFAULT '0'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Dumping data for table `role_permissions`
--

INSERT INTO `role_permissions` (`id`, `role_id`, `permission_id`, `list`, `insert`, `update`, `delete`) VALUES
(1, 1, 1, 1, 1, 1, 1),
(2, 1, 6, 1, 1, 1, 1),
(3, 1, 5, 1, 1, 1, 1),
(4, 1, 4, 1, 1, 1, 1),
(5, 1, 3, 1, 1, 1, 1),
(6, 1, 2, 1, 1, 1, 1),
(7, 4, 2, 1, 1, 1, 0),
(8, 4, 3, 1, 1, 1, 0),
(9, 4, 4, 1, 1, 1, 0),
(10, 4, 5, 1, 0, 0, 0),
(11, 4, 6, 1, 0, 0, 0),
(12, 5, 6, 1, 1, 1, 0),
(13, 4, 1, 1, 1, 1, 0),
(14, 1, 7, 1, 1, 1, 1),
(15, 1, 8, 1, 1, 1, 1),
(16, 1, 9, 1, 1, 1, 1),
(17, 1, 10, 1, 1, 1, 1),
(18, 1, 11, 1, 1, 1, 1),
(19, 1, 12, 1, 1, 1, 1),
(20, 1, 13, 1, 1, 1, 1),
(21, 1, 14, 1, 1, 1, 1),
(22, 1, 15, 1, 1, 1, 1),
(23, 1, 16, 1, 1, 1, 1),
(24, 1, 17, 1, 1, 1, 1),
(25, 1, 18, 1, 1, 1, 1),
(26, 1, 19, 1, 1, 1, 1),
(27, 1, 20, 1, 1, 1, 1),
(28, 1, 21, 1, 1, 1, 1),
(29, 1, 22, 1, 1, 1, 1),
(30, 1, 23, 1, 1, 1, 1),
(31, 1, 24, 1, 1, 1, 1),
(32, 1, 25, 1, 1, 1, 1),
(33, 4, 7, 1, 1, 1, 0),
(34, 4, 8, 1, 1, 1, 0),
(35, 4, 14, 1, 1, 1, 0),
(36, 4, 15, 1, 1, 1, 0),
(37, 5, 5, 1, 1, 1, 0),
(38, 5, 1, 1, 1, 1, 0),
(39, 5, 2, 1, 1, 1, 0),
(40, 5, 3, 1, 1, 1, 0),
(41, 5, 4, 1, 1, 1, 0),
(42, 5, 7, 1, 1, 1, 0),
(43, 5, 8, 1, 1, 1, 0),
(44, 5, 9, 1, 1, 1, 0),
(45, 5, 10, 1, 1, 1, 0),
(46, 5, 11, 1, 1, 1, 0),
(47, 5, 12, 1, 1, 1, 0),
(48, 5, 13, 1, 1, 1, 0),
(49, 5, 14, 1, 0, 0, 0),
(50, 5, 14, 1, 1, 1, 0),
(51, 5, 15, 1, 1, 1, 0),
(52, 4, 13, 1, 0, 0, 0),
(53, 4, 12, 1, 0, 0, 0),
(54, 4, 11, 1, 0, 0, 0),
(55, 4, 10, 1, 0, 0, 0),
(56, 4, 9, 1, 0, 0, 0),
(57, 10, 1, 1, 0, 0, 0),
(58, 10, 2, 1, 0, 0, 0),
(59, 10, 4, 1, 0, 0, 0),
(60, 10, 3, 1, 0, 0, 0),
(61, 10, 5, 1, 0, 0, 0),
(62, 10, 7, 1, 0, 0, 0),
(63, 10, 6, 1, 0, 0, 0),
(64, 10, 8, 1, 0, 0, 0),
(65, 10, 9, 1, 0, 0, 0),
(66, 10, 10, 1, 0, 0, 0),
(67, 10, 12, 1, 0, 0, 0),
(68, 10, 11, 1, 0, 0, 0),
(69, 10, 13, 1, 0, 0, 0),
(70, 10, 14, 1, 0, 0, 0),
(71, 10, 15, 1, 0, 0, 0),
(72, 10, 16, 1, 0, 0, 0),
(73, 10, 17, 1, 0, 0, 0),
(74, 10, 19, 1, 0, 0, 0),
(75, 10, 20, 1, 0, 0, 0),
(76, 10, 21, 1, 0, 0, 0),
(77, 10, 22, 1, 0, 0, 0),
(78, 10, 23, 1, 0, 0, 0),
(79, 10, 24, 1, 0, 0, 0),
(80, 10, 25, 1, 0, 0, 0),
(81, 1, 26, 1, 1, 1, 1),
(82, 1, 28, 1, 1, 1, 1),
(83, 1, 27, 1, 1, 1, 1);

-- --------------------------------------------------------

--
-- Table structure for table `slides`
--

CREATE TABLE `slides` (
  `id` int(11) NOT NULL,
  `name` text NOT NULL,
  `photo` varchar(80) NOT NULL,
  `create_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `active` tinyint(4) DEFAULT '1',
  `order` tinyint(4) DEFAULT '0',
  `url` varchar(200) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `slides`
--

INSERT INTO `slides` (`id`, `name`, `photo`, `create_at`, `active`, `order`, `url`) VALUES
(1, 'Wedoo', 'ddd-min.png', '2018-02-11 03:14:45', 0, 0, NULL),
(2, 'Vdoo Solutions', 'hh.png', '2018-02-11 03:19:03', 0, 1, NULL),
(3, 'test', 'fish.jpg', '2018-02-11 03:19:24', 0, 0, NULL),
(4, 'Vdoo Solutions', 'dream_village_hd.jpg', '2018-02-11 03:36:38', 0, 0, NULL),
(5, 'Vdoo Solutions', 'post-4.png', '2018-02-11 15:37:03', 0, 0, NULL),
(6, 'EU Cycling tour', 'slide2.jpg', '2018-03-01 04:26:52', 0, 1, 'http://vdoo.biz/'),
(7, 'EU Cycling tour EU Cycling tour EU Cycling tour EU Cycling tour', 'slide1.jpg', '2018-03-01 04:27:04', 1, 2, '#'),
(8, 'EU Cycling tour', 'slide9-min.png', '2018-03-01 04:47:39', 0, 3, NULL),
(9, 'vichey', '4-min.png', '2018-03-13 16:46:01', 0, 0, '456789'),
(10, 'Hello Everyone I would to tell you about me Hello Everyone I would to tell you about me Hello Everyone I would to tell you about me Hello Everyone I would to tell you about me Hello Everyone I would to tell you about me', 'slide2.jpg', '2018-05-08 16:05:14', 1, 3, '#'),
(11, 'EU Cycling tourEU Cycling tourEU Cycling tourEU Cycling tourEU Cycling tourEU Cycling tour', '1-min.png', '2018-05-09 18:27:13', 0, 0, NULL),
(12, 'test', 'swDNLSxupk2p74uja.jpeg', '2018-05-19 12:20:59', 0, 1, 'https://www.facebook.com/');

-- --------------------------------------------------------

--
-- Table structure for table `socials`
--

CREATE TABLE `socials` (
  `id` tinyint(4) NOT NULL,
  `name` varchar(50) DEFAULT NULL,
  `url` varchar(120) DEFAULT NULL,
  `icon` varchar(60) DEFAULT NULL,
  `order_number` int(11) DEFAULT '0',
  `active` tinyint(4) DEFAULT '1',
  `create_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `socials`
--

INSERT INTO `socials` (`id`, `name`, `url`, `icon`, `order_number`, `active`, `create_at`) VALUES
(1, 'Facebook', '#', 'tw.png', 2, 0, '2017-08-15 07:53:35'),
(2, 'Facebook', 'https://www.facebook.com/ecc007', 'fb.png', 1, 1, '2018-05-09 17:01:16'),
(3, 'Linkedin', 'https://www.facebook.com/', 'in.png', 3, 1, '2018-05-09 17:01:36'),
(4, 'Gmail', 'https://www.email.com/', 'g.png', 4, 1, '2018-05-09 17:02:02');

-- --------------------------------------------------------

--
-- Table structure for table `sub_menus`
--

CREATE TABLE `sub_menus` (
  `id` int(11) NOT NULL,
  `name` varchar(200) NOT NULL,
  `url` varchar(250) DEFAULT '#',
  `parent_id` int(11) NOT NULL DEFAULT '0',
  `order_number` int(11) DEFAULT '0',
  `active` tinyint(4) NOT NULL DEFAULT '1',
  `create_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `sub_menus`
--

INSERT INTO `sub_menus` (`id`, `name`, `url`, `parent_id`, `order_number`, `active`, `create_at`) VALUES
(1, 'Vdoo Solutions', 'https://www.youtube.com/embed/1v_aIK_sXNs', 8, 11, 0, '2018-03-13 04:44:14'),
(2, 'Vdoo Solutions', NULL, 7, 1, 0, '2018-03-13 04:44:38'),
(3, 'Site Construction', '3', 7, 2, 1, '2018-03-13 04:46:27'),
(4, 'Consulting', '/page/3', 7, 1, 1, '2018-03-13 04:50:18');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `password` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `remember_token` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `photo` varchar(120) COLLATE utf8mb4_unicode_ci DEFAULT 'default.png',
  `language` varchar(2) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'en',
  `role_id` int(11) NOT NULL DEFAULT '1'
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `name`, `email`, `password`, `remember_token`, `created_at`, `updated_at`, `photo`, `language`, `role_id`) VALUES
(1, 'Ratha Sok', 'admin@gmail.com', '$2y$10$YfZEjryxGfiH8aOrxX/0jOyHYry53o9uMbyrVos4I2gogKv2t1OHG', 'BVAMIdfzaqB4vgbCQEFfMAPNgIonk69r5U6KrcDNyPSAoPRmeke0f997A9uf', '2017-05-27 22:35:52', '2017-05-27 22:35:52', '1 copy.jpg', 'en', 1),
(3, 'root', 'root', '$2y$10$Gsp.GBk0VSV6gCITRnG3..y1G8hVzU86HlXA9kl1CQ46vIq/EU/ey', NULL, '2017-11-09 06:00:00', '2017-11-09 06:00:00', 'default.png', 'en', 1),
(4, 'SINA.L', 'lem.sina007@gmail.com', '$2y$10$SMP.xu7s1Nh24OHcqTs/EOKaLeCLwZBgqdDDcuDjWZMYU7/yuElRK', NULL, NULL, NULL, 'SMGV5960.jpg', 'en', 1),
(5, 'Parany Soeurm', 'ranypa852@gmail.com', '$2y$10$7STuALxOE2qiIMCdviLfr.MeB8CR27FS6neE7XZnIkVt8gua6efiO', '1KLKr8wSH4vVdu6XRBx8snf5Yxn3TI04vvvKlhgvc20uXD4DrEG24Q7u8tWt', NULL, NULL, 'IMG_7478a copy.jpg', 'en', 4),
(6, 'Sok Kimseng', 'kimseng.s@hrangkor.com', '$2y$10$1W7LVIbmw2/MzHzXaBIw/uFm36SdN1QGeKXbEEEv42.o5w8A8i4EG', '5uHmYRHLkZsmoVfM0s6QYounifcIuZE4aOiDNBBS0OLf61XB97bb4BnbDjOp', NULL, NULL, 'kimseng.jpg', 'en', 10),
(7, 'Kimrong Vichheka', 'vichheka.k@hrangkor.com', '$2y$10$0IYNBFlbxsChc/Q46uZjbO55nq252z3LDUHsLkiDyMPPV2RMyIfNm', 'ElvfpaS3qpsLM7blFUjN7uMlHBTJzzZ7igybykQTHF091Qpih0L0Rx4Y1MTT', NULL, NULL, 'k.jpg', 'en', 10);

-- --------------------------------------------------------

--
-- Table structure for table `videos`
--

CREATE TABLE `videos` (
  `id` int(11) NOT NULL,
  `url` varchar(225) DEFAULT NULL,
  `active` tinyint(4) NOT NULL DEFAULT '1',
  `create_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `title` varchar(225) NOT NULL,
  `poster_image` varchar(250) DEFAULT NULL,
  `category_id` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `videos`
--

INSERT INTO `videos` (`id`, `url`, `active`, `create_at`, `title`, `poster_image`, `category_id`) VALUES
(1, 'https://www.youtube.com/embed/s3wiVLYl_UU', 1, '2018-02-07 02:35:12', 'Life Of Progammer', 'video1.jpg', 1),
(2, 'https://www.youtube.com/embed/ABy95341Dto', 1, '2018-02-07 02:38:18', 'Create Dynamic Website with PHP', 'video2.png', 1),
(3, 'https://www.youtube.com/embed/ABy95341Dto', 1, '2018-02-07 02:51:02', 'Design Website with Bootstrap', 'video3.png', 1),
(4, 'https://www.youtube.com/embed/8gJ80T6VVIQ', 1, '2018-02-07 02:55:52', 'Learn To Do Animation In JavaScript', 'video4.png', 1),
(5, 'https://www.youtube.com/embed/Aw71zanwMnY', 1, '2018-03-17 07:26:57', 'Learn To Think As A Programmer', 'video5.jpg', 1),
(6, 'https://www.youtube.com/embed/s3wiVLYl_UU', 1, '2018-05-09 14:43:03', 'Lear To Design Website With CSS3', 'video6.png', 1),
(7, 'Test', 0, '2018-05-29 11:42:47', 'Test', 'video7.png', 1);

-- --------------------------------------------------------

--
-- Table structure for table `video_categories`
--

CREATE TABLE `video_categories` (
  `id` int(11) NOT NULL,
  `name` varchar(90) NOT NULL,
  `active` bit(1) NOT NULL DEFAULT b'1',
  `create_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `video_categories`
--

INSERT INTO `video_categories` (`id`, `name`, `active`, `create_at`) VALUES
(1, 'Football Match', b'1', '2018-05-29 10:11:48');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `advertisements`
--
ALTER TABLE `advertisements`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `background_images`
--
ALTER TABLE `background_images`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `company_features`
--
ALTER TABLE `company_features`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `current_projects`
--
ALTER TABLE `current_projects`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `featured_works`
--
ALTER TABLE `featured_works`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `main_menus`
--
ALTER TABLE `main_menus`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `our_services`
--
ALTER TABLE `our_services`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `pages`
--
ALTER TABLE `pages`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `partners`
--
ALTER TABLE `partners`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `permissions`
--
ALTER TABLE `permissions`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `portfolios`
--
ALTER TABLE `portfolios`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `portfolio_categories`
--
ALTER TABLE `portfolio_categories`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `posts`
--
ALTER TABLE `posts`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `project_locations`
--
ALTER TABLE `project_locations`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `project_regions`
--
ALTER TABLE `project_regions`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `recent_news`
--
ALTER TABLE `recent_news`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `roles`
--
ALTER TABLE `roles`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `role_permissions`
--
ALTER TABLE `role_permissions`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `slides`
--
ALTER TABLE `slides`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `socials`
--
ALTER TABLE `socials`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `sub_menus`
--
ALTER TABLE `sub_menus`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `videos`
--
ALTER TABLE `videos`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `video_categories`
--
ALTER TABLE `video_categories`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `advertisements`
--
ALTER TABLE `advertisements`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `background_images`
--
ALTER TABLE `background_images`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `categories`
--
ALTER TABLE `categories`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=16;

--
-- AUTO_INCREMENT for table `company_features`
--
ALTER TABLE `company_features`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `current_projects`
--
ALTER TABLE `current_projects`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `featured_works`
--
ALTER TABLE `featured_works`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=18;

--
-- AUTO_INCREMENT for table `main_menus`
--
ALTER TABLE `main_menus`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- AUTO_INCREMENT for table `our_services`
--
ALTER TABLE `our_services`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `pages`
--
ALTER TABLE `pages`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT for table `partners`
--
ALTER TABLE `partners`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=30;

--
-- AUTO_INCREMENT for table `permissions`
--
ALTER TABLE `permissions`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=29;

--
-- AUTO_INCREMENT for table `portfolios`
--
ALTER TABLE `portfolios`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;

--
-- AUTO_INCREMENT for table `portfolio_categories`
--
ALTER TABLE `portfolio_categories`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT for table `posts`
--
ALTER TABLE `posts`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=18;

--
-- AUTO_INCREMENT for table `project_locations`
--
ALTER TABLE `project_locations`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `project_regions`
--
ALTER TABLE `project_regions`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `recent_news`
--
ALTER TABLE `recent_news`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `roles`
--
ALTER TABLE `roles`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT for table `role_permissions`
--
ALTER TABLE `role_permissions`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=84;

--
-- AUTO_INCREMENT for table `slides`
--
ALTER TABLE `slides`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- AUTO_INCREMENT for table `socials`
--
ALTER TABLE `socials`
  MODIFY `id` tinyint(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `sub_menus`
--
ALTER TABLE `sub_menus`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT for table `videos`
--
ALTER TABLE `videos`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT for table `video_categories`
--
ALTER TABLE `video_categories`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
